[
    {
        "client_msg_id": "97e79fad-0bb1-469d-b500-b248580e348c",
        "type": "message",
        "text": "\"An example of what frustrated (frustrates) me growing up was walking around a video game world complete with environment, characters etc. and not having any control to modify or create any of the game myself, without going back to 'square 1' so to speak. I look forward to following the conversations as they develop here\"\n\nI'm not sure what games you were playing, but there are many examples of games where you don't have to go back to 'square 1' to edit game behavior.  It's true there aren't many games where creation and editing is a first class feature, but in most video games (even in games were simulation and immersion are important) its not the goal, and encouraging free modification would \"break\" the game.  You can make arguments that for single player games that doesn't matter, but it does end up removing challenge.\n\nThat said a lot of games support modding as an important thing, even if you have to download a mod sdk, and editing isn't completely intuitive, etc.   This includes major, super popular games that begat even more popular games through modification (Warcraft 3 -&gt; Dota, Half-Life -&gt; Counterstrike, ARMA 3 -&gt; PUBG). Media Molecule's games Little Big Planet and the upcoming Dreams make creation first class, so you probably want to check those out if that's your main frustration.  This is a bad example coming from someone that's not really familiar with video game history or design.  It makes sense coming from someone that remembers some random game that they either couldn't edit or didn't know how, and that's a valid complaint, but its not representative of games as a whole.",
        "user": "UBSMEUXAA",
        "ts": "1539023605.000100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "0edf98a60210",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-09-26\/774747080560_0edf98a60210d3ab07ea_72.jpg",
            "first_name": "",
            "real_name": "Scott Anderson",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "scottan",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1538900103.000100",
        "parent_user_id": "UD72R4WTU"
    },
    {
        "client_msg_id": "c027737e-f32c-47d4-ab00-8d66bafe1342",
        "type": "message",
        "text": "Thanks for your reply. For interest, the games I had in mind are mostly FPSs eg. Halo. I think it's an interesting discussion point. I am not so keen on making the point of the game itself to support modification but rather just the fact that you have some software asks the question of why can you not modify it.\n\n\"even if you have to download a mod sdk, and editing isn't completely intuitive, etc.\" is what we want to get away from I think? Can we cross the chasm between \"I can make this thing already using existing tools if I spend enough time on it\" versus \"I can make this thing quickly and intuitively\"?",
        "user": "UD72R4WTU",
        "ts": "1539031411.000100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gbf6529b783d",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/1bf6529b783d90f2c7860fbf61f28819.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0005-72.png",
            "first_name": "",
            "real_name": "Jeremy Forsythe",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "jjforsythe133",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UD72R4WTU",
            "ts": "1539031418.000000"
        },
        "thread_ts": "1538900103.000100",
        "parent_user_id": "UD72R4WTU"
    },
    {
        "client_msg_id": "9930622e-8446-4de4-a193-d96834d091f5",
        "type": "message",
        "text": "Halo is a great example of a game series that has supported modification in a first class way, even on console which is rare due to technical and market constraints.  I don't think the original xbox version of Halo had modification, but Halo 3 allowed for custom game modes and had forge (<https:\/\/www.halopedia.org\/Forge>) which allowed you to customize maps.  With Halo its tricky though because eventually you run into the technical constraints of console games, unless you build your game from the ground up to also be an editor and programming environment (at the sacrifice of quality), console games run into memory, compute and security issues.  Console games are made on PCs that are significantly more powerful than the consoles they run on, and often have build processes that do hours or days of precomputation using distributed build processes (for example ray tracing for lighting).  Once again you can build, but the goal of most console games (and the desire of the market) is not creative expression.",
        "user": "UBSMEUXAA",
        "ts": "1539037841.000100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "0edf98a60210",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-09-26\/774747080560_0edf98a60210d3ab07ea_72.jpg",
            "first_name": "",
            "real_name": "Scott Anderson",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "scottan",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1538900103.000100",
        "parent_user_id": "UD72R4WTU"
    },
    {
        "client_msg_id": "0ecce69c-bef6-454b-8c26-e6951f8d1084",
        "type": "message",
        "text": "so the answer of \"why can I not modify it\" is one of cost vs. value in games",
        "user": "UBSMEUXAA",
        "ts": "1539037861.000100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "0edf98a60210",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-09-26\/774747080560_0edf98a60210d3ab07ea_72.jpg",
            "first_name": "",
            "real_name": "Scott Anderson",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "scottan",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1538900103.000100",
        "parent_user_id": "UD72R4WTU"
    },
    {
        "client_msg_id": "ac6dd693-9799-4814-bebb-34cf309d4786",
        "type": "message",
        "text": "But there are plenty of examples were you can modify games in an intuitive way",
        "user": "UBSMEUXAA",
        "ts": "1539038012.000100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "0edf98a60210",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-09-26\/774747080560_0edf98a60210d3ab07ea_72.jpg",
            "first_name": "",
            "real_name": "Scott Anderson",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "scottan",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1538900103.000100",
        "parent_user_id": "UD72R4WTU"
    }
]