[
    {
        "client_msg_id": "38D05BC0-1148-4254-8B5A-A6219B897EEE",
        "type": "message",
        "text": "tried to make a PR to fix formatting on <http:\/\/www.rust-lang.org|www.rust-lang.org>. cloned the repo, ran cargo, 350+ deps, 7000+ files. ",
        "user": "UC6997THT",
        "ts": "1571377866.020000",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "f3eb3ca69d86",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-08-13\/414472553296_f3eb3ca69d86feb77929_72.png",
            "first_name": "Gregg",
            "real_name": "Gregg Tavares",
            "display_name": "gman",
            "team": "T5TCAFTA9",
            "name": "slack1",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1570003136.129400",
        "parent_user_id": "UEQ6M68H0"
    },
    {
        "client_msg_id": "9C951BBF-6AB2-4738-8D42-71CE8CD25E66",
        "type": "message",
        "text": "is this what powershell is\/was all about. apps pipe structured objects to each other instead of text\n\n\n<https:\/\/en.m.wikipedia.org\/wiki\/PowerShell>",
        "user": "UC6997THT",
        "ts": "1571378802.022000",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "f3eb3ca69d86",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-08-13\/414472553296_f3eb3ca69d86feb77929_72.png",
            "first_name": "Gregg",
            "real_name": "Gregg Tavares",
            "display_name": "gman",
            "team": "T5TCAFTA9",
            "name": "slack1",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d5\/Windows_PowerShell_1.0_PD.png",
                "image_width": 658,
                "image_height": 696,
                "image_bytes": 15043,
                "title": "PowerShell",
                "title_link": "https:\/\/en.m.wikipedia.org\/wiki\/PowerShell",
                "from_url": "https:\/\/en.m.wikipedia.org\/wiki\/PowerShell",
                "author_name": "Wikipedia",
                "author_link": "https:\/\/en.wikipedia.org\/",
                "text": "PowerShell is a task automation and configuration management framework from Microsoft, consisting of a command-line shell and associated scripting language. Initially a Windows component only, known as Windows PowerShell, it was made open-source and cross-platform on 18 August 2016 with the introduction of PowerShell Core. The former is built on .NET Framework while the latter on .NET Core.\nIn PowerShell, administrative tasks are generally performed by cmdlets (pronounced command-lets), which are specialized .NET classes implementing a particular operation. These work by accessing data in different data stores, like the file system or registry, which are made available to PowerShell via providers. Third-party developers can add cmdlets and providers to PowerShell. Cmdlets may be used by scripts and scripts may be packaged into modules.\nPowerShell provides full access to COM and WMI, enabling administrators to perform administrative tasks on both local and remote Windows systems as well as WS-Management and CIM enabling management of remote Linux systems and network devices. PowerShell also provides a hosting API with which the PowerShell runtime can be embedded inside other applications. These applications can then use PowerShell functionality to implement certain operations, including those exposed via the graphical interface. This capability has been used by Microsoft Exchange Server 2007 to expose its management functionality as PowerShell cmdlets and providers and implement the graphical management tools as PowerShell hosts which invoke the necessary cmdlets. Other Microsoft applications including Microsoft SQL Server 2008 also expose their management interface via PowerShell cmdlets.PowerShell includes its own extensive, console-based help (similar to man pages in Unix shells) accessible via the Get-Help cmdlet. Local help contents can be retrieved from the Internet via Update-Help cmdlet. Alternatively, help from the web can be acquired on a case-by-case basis via the -online switch to Get-Help.",
                "fallback": "wikipedia: PowerShell",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/wikipedia.png",
                "id": 1,
                "original_url": "https:\/\/en.m.wikipedia.org\/wiki\/PowerShell"
            }
        ],
        "thread_ts": "1570035650.132600",
        "parent_user_id": "UCUSW7WVD"
    }
]