[
    {
        "client_msg_id": "46733dec-7dba-4006-8573-a59b79552ad2",
        "type": "message",
        "text": "Dear Ms. Solstad,  if your abstract algebra is good, programming will be easy. Frankly programming uses very little math; the necessary pre-requisites are not taught well in school however; you can go through calculus and not be exposed to what they call \"discrete math\", which includes set theory, boolean algebra, combinatorics, etc.  You are entering the field at an odd time in history, because programming was once easier, but more limited. Now, with billions of computers around in all sizes, programming has become very challenging, and the haphazard way the dominant programming stacks were created has resulted in a huge mess. Javascript, which by many measures is the #1 language is a \"hot mess\" as they call it. We are at what i perceive was the tail end of OOP era, and are at the boundary of a whole new, much easier era, So it is a great time to jump in if you look forward a bit. One of the best ways to learn is to build something very simple. Find the absolutely simplest thing you can imagine, and do that. My first program was finding the area of a triangle. Motivation precedes achievement, and since you want to make more human things, perhaps you can apply your knowledge of stage directing and acting to think of some tool that would benefit actors to memorize lines, or tools synchronize lighting cues, or something that combines your real world knowledge, and programming. It has been somewhat tragic that computer programmers are often in charge of figuring out what to build, when they don't have knowledge of the outside world. You can be a very successful programmer, and never leave your bathrobe and slippers.",
        "user": "UEQ6M68H0",
        "ts": "1549345440.134400",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "326328f75c3f",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-02-05\/542651515888_326328f75c3f2a08544c_72.jpg",
            "first_name": "Edward",
            "real_name": "Edward de Jong",
            "display_name": "Edward de Jong \/ Beads Project",
            "team": "T5TCAFTA9",
            "name": "magicmouse94937",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1543246698.111700",
        "parent_user_id": "UEBU4L0BD"
    }
]