[
    {
        "client_msg_id": "8205f81e-2bd1-42b6-90b5-aede2acd7629",
        "type": "message",
        "text": "I had never heard about tree notation before, but it looks very interesting! But I can't say that your blog post has helped me much with understanding tree notation (I find the standard Web site much clearer).\nExample: you say that each cell has a cellSize. Fine. You don't say what a cellSize is, sematically, but the name \"size\" suggests a magnitude (e.g. a number). Then you say that cells can be combined horizontally and/or vertically. So is the cellSize perhaps a pair of numbers?\nNext, a Tree consists of a line of cells and/or a plane of child Trees. Neither line nor plane have been defined, so I take them to have their standard meaning in geometry. let's take the \"and\" case: a tree can then be a line of cells AND a plane of child trees. I have no idea what that would look like.",
        "user": "UJBAJNFLK",
        "ts": "1570889040.032200",
        "team": "T5TCAFTA9",
        "thread_ts": "1570582830.061900",
        "parent_user_id": "UMVFWPZ36"
    },
    {
        "client_msg_id": "679d231f-f0d8-4e07-b8f1-26044db113c5",
        "type": "message",
        "text": "Very helpful! Thanks <@UJBAJNFLK>. Yes, cellSize as currently envisioned is a pair of numbers, with a size and height. Another term have been trying out for a cell is a \"2D register\". So like we have 1-dimensional 64-bit registers, you'd have 2-dimensional 8x8 bit registers.",
        "user": "UMVFWPZ36",
        "ts": "1570912804.032800",
        "team": "T5TCAFTA9",
        "thread_ts": "1570582830.061900",
        "parent_user_id": "UMVFWPZ36"
    },
    {
        "client_msg_id": "a1a44e67-c521-4492-ab06-947153592a9f",
        "type": "message",
        "text": "I'll define a line and plane (using roughly the same meanings as from geometry). A Tree is a line and a plane that starts on the line below it, indented.  That might not be too clear but I've made a github issue with your feedback for the next revision. Thanks!",
        "user": "UMVFWPZ36",
        "ts": "1570912960.033000",
        "team": "T5TCAFTA9",
        "thread_ts": "1570582830.061900",
        "parent_user_id": "UMVFWPZ36"
    }
]