[
    {
        "client_msg_id": "8e929575-63a2-4be0-8c92-6668522ea3d5",
        "type": "message",
        "text": "[OT] what a great thread, sadly most of people on FoC will miss it and we collectively will miss it in a few months, this looks really valuable and reminds me of reading back and forths in the c2 wiki :slightly_smiling_face:\n\nWhat I would love for a tool (of thought :stuck_out_tongue:) is the ability of the people in this conversation to go back, summarize and highlight parts of the conversation for people comming to it later to get a gist or a refinement of the conversation after it happened since I think most of the participants have a clearer idea at the end than at the beginning and the clearest idea just after finishing the conversation, after that the subtelties will fade out (like tears in the rain :stuck_out_tongue:). I've been thinking about a slack\/wiki hybrid where you start from threads and start refining them into articles, you can still jump back to previous iterations of the article and the raw conversation, but the entry point is an organized summary.",
        "user": "UBN9AFS0N",
        "ts": "1574674319.319600",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "7f0f1c0238ec",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-07-09\/395086754178_7f0f1c0238ec02befdab_72.jpg",
            "first_name": "Mariano",
            "real_name": "Mariano Guerra",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "mariano",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "AYVQ",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "[OT] what a great thread, sadly most of people on FoC will miss it and we collectively will miss it in a few months, this looks really valuable and reminds me of reading back and forths in the c2 wiki "
                            },
                            {
                                "type": "emoji",
                                "name": "slightly_smiling_face"
                            },
                            {
                                "type": "text",
                                "text": "\n\nWhat I would love for a tool (of thought "
                            },
                            {
                                "type": "emoji",
                                "name": "stuck_out_tongue"
                            },
                            {
                                "type": "text",
                                "text": ") is the ability of the people in this conversation to go back, summarize and highlight parts of the conversation for people comming to it later to get a gist or a refinement of the conversation after it happened since I think most of the participants have a clearer idea at the end than at the beginning and the clearest idea just after finishing the conversation, after that the subtelties will fade out (like tears in the rain "
                            },
                            {
                                "type": "emoji",
                                "name": "stuck_out_tongue"
                            },
                            {
                                "type": "text",
                                "text": "). I've been thinking about a slack\/wiki hybrid where you start from threads and start refining them into articles, you can still jump back to previous iterations of the article and the raw conversation, but the entry point is an organized summary."
                            }
                        ]
                    }
                ]
            }
        ],
        "thread_ts": "1574069038.213900",
        "parent_user_id": "U5STGTB3J",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "UCUSW7WVD",
                    "U9C92716C"
                ],
                "count": 2
            }
        ]
    }
]