[
    {
        "client_msg_id": "d1d807d7-b4df-4bbf-8c67-b01b2b0edd67",
        "type": "message",
        "text": "&gt; It's 2019 and two devices used by the same person in the same room still can't cooperate on something like this. That's kind of embarrassing, isn't it?\n\nEven more basic than that, I have to disable Google Assistant on my phone because when I talk to Google Home my phone's Google Assistant will perform the same action at the same time consistently.  The phone is aware of the device (same wifi network), and I've heard from other people this should \"work\" but it consistently breaks for me.  I think one problem is the more \"magic\" you add to these devices the less predictable and stable they are.  So sure, it'd be great to forward the call or reduce volume in that scenario, but without more context it could feel buggy, or be annoying to the user.  For example if you want to have a semi-private phone call, and it forwards your call to a speaker another room that is physically nearby, but maybe not private anymore, that's a big problem.  Currently Google has no context here.  You can add more sensors and more AI and get there eventually, but you also end up with less deterministic behavior and more \"does the machine follow proper social etiquette?\" uncanny valley type situations",
        "user": "UBSMEUXAA",
        "ts": "1557425784.065800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "0edf98a60210",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-09-26\/774747080560_0edf98a60210d3ab07ea_72.jpg",
            "first_name": "",
            "real_name": "Scott Anderson",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "scottan",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1557319713.052600",
        "parent_user_id": "UAL7940NM"
    }
]