[
    {
        "client_msg_id": "bc680c04-f34b-4765-b727-9381b4faa7e3",
        "type": "message",
        "text": "Thinking about spacial reasoning in UI design:\n\n<https:\/\/medium.com\/elepath-exports\/spatial-interfaces-886bccc5d1e9>",
        "user": "UAVCC2X70",
        "ts": "1558812112.000800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "ec35ac5b251f",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-05-22\/369438371830_ec35ac5b251f37e26aca_72.jpg",
            "first_name": "",
            "real_name": "Dan Cook",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "dcook0819",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1558812112.000800",
        "reply_count": 2,
        "reply_users_count": 2,
        "latest_reply": "1558837531.001500",
        "reply_users": [
            "UAVCC2X70",
            "UA14TGLTC"
        ],
        "replies": [
            {
                "user": "UAVCC2X70",
                "ts": "1558815110.000900"
            },
            {
                "user": "UA14TGLTC",
                "ts": "1558837531.001500"
            }
        ],
        "is_locked": false,
        "subscribed": false,
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UJN1TAYEQ",
                    "UC2A2ARPT",
                    "UA14TGLTC",
                    "UEQ7QL15F",
                    "UFEQUBNNT"
                ],
                "count": 5
            }
        ]
    },
    {
        "client_msg_id": "9d26fe41-cab6-4857-b306-08bcb3909fcf",
        "type": "message",
        "text": "This (shorter) one gives me hope for what some of us are doing (e.g. big disruptive changes start out looking like a toy):\n\n<http:\/\/cdixon.org\/2010\/01\/03\/the-next-big-thing-will-start-out-looking-like-a-toy\/>",
        "user": "UAVCC2X70",
        "ts": "1558815110.000900",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "ec35ac5b251f",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-05-22\/369438371830_ec35ac5b251f37e26aca_72.jpg",
            "first_name": "",
            "real_name": "Dan Cook",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "dcook0819",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "cdixon blog",
                "service_url": "http:\/\/cdixon.org",
                "title": "The next big thing will start out looking like a toy",
                "title_link": "http:\/\/cdixon.org\/2010\/01\/03\/the-next-big-thing-will-start-out-looking-like-a-toy\/",
                "author_name": "cdixon",
                "author_link": "https:\/\/cdixon.org\/author\/cdixon2000\/",
                "text": "One of the amazing things about the internet economy is how different the list of top internet properties today looks from the list ten years ago. &nbsp;It wasn&rsquo;t as if those former top companies were complacent &ndash; most of them acquired and built products like crazy to avoid being displaced.\nThe reason big new things sneak by incumbents is that&nbsp;the next big thing always starts out being dismissed as a &ldquo;toy.&rdquo; &nbsp;This is one of the main insights of Clay Christensen&rsquo;s &ldquo;disruptive technology&rdquo; theory. This theory starts with the observation that technologies tend to get better at a faster rate than users&rsquo; needs increase. From this simple insight follows all kinds of interesting conclusions about how markets and products change over time. \nDisruptive technologies are dismissed as toys because when they are first launched they &ldquo;undershoot&rdquo; user needs. The first telephone could only carry voices a mile or two. The leading telco of the time, Western Union, passed on acquiring the phone because they didn&rsquo;t see how it could possibly be useful to businesses and railroads &ndash; their primary customers. What they failed to anticipate was how rapidly telephone technology and infrastructure would improve (technology adoption is usually non-linear due to so-called complementary network effects). The same was true of how mainframe companies viewed the PC (microcomputer), and how modern telecom companies viewed Skype. (Christensen has many more examples in his books).\nThis does not mean every product that looks like a toy will turn out to be the next big thing. To distinguish toys that are disruptive from toys that will remain just toys, you need to look at&nbsp;products as processes. Obviously, products get better inasmuch as the designer adds features, but this is a relatively weak force. Much more powerful are external forces: microchips getting cheaper, bandwidth becoming ubiquitous, mobile devices getting smarter, etc. For a product to be disruptive it needs to be designed to ride these changes up the utility curve.\nSocial software is an interesting special case where the strongest forces of improvement are users&rsquo; actions. As Clay Shirky explains in&nbsp;his latest book, Wikipedia is literally a process &ndash; every day it is edited by spammers, vandals, wackos etc., yet every day the good guys make it better at a faster rate. If you had gone back to 2001 and analyzed Wikipedia as a static product it would have looked very much like a toy. The reason Wikipedia works so brilliantly are subtle design features that sculpt the torrent of user edits such that they yield a net improvement over time. Since users&rsquo; needs for encyclopedic information remains relatively steady, as long as Wikipedia got steadily better, it would eventually meet and surpass user needs.\nA product doesn&rsquo;t have to be disruptive to be valuable. There are plenty of products that are useful from day one and continue being useful long term. These are what Christensen calls sustaining technologies. When startups build useful sustaining technologies, they are often quickly acquired or copied by incumbents. If your timing and execution is right, you can create a very successful business on the back of a sustaining technology.\nBut startups with sustaining technologies are very unlikely to be the new ones we see on top lists in 2020. Those will be disruptive technologies &ndash; the ones that sneak by because people dismiss them as toys.",
                "fallback": "cdixon blog Link: The next big thing will start out looking like a&nbsp;toy",
                "from_url": "http:\/\/cdixon.org\/2010\/01\/03\/the-next-big-thing-will-start-out-looking-like-a-toy\/",
                "service_icon": "http:\/\/1.gravatar.com\/blavatar\/9c35ca135481aaf921b451d6b4861545?s=114",
                "id": 1,
                "original_url": "http:\/\/cdixon.org\/2010\/01\/03\/the-next-big-thing-will-start-out-looking-like-a-toy\/"
            }
        ],
        "thread_ts": "1558812112.000800",
        "parent_user_id": "UAVCC2X70",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UEQ7QL15F"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "241312ab-734f-4ecf-921b-216c337593bb",
        "type": "message",
        "text": "Oh how I hate transition animations that make no sense!",
        "user": "UA14TGLTC",
        "ts": "1558837531.001500",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gae6d55db9d1",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/3ae6d55db9d15b79bc683a8031fc2588.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0009-72.png",
            "first_name": "",
            "real_name": "William Taysom",
            "display_name": "wtaysom",
            "team": "T5TCAFTA9",
            "name": "wtaysom",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1558812112.000800",
        "parent_user_id": "UAVCC2X70"
    }
]