[
    {
        "client_msg_id": "ab3a1b43-df2d-449b-b96e-14b924a3d955",
        "type": "message",
        "text": "<@UDJ8A6RNH> I have many interrelated and inter-dependent goals, and I’m constantly looking for the most optimal opportunities to achieve progress on one or more of them. I admit this can make deep focus a bit challenging. :slightly_smiling_face:\n\nAnd lately I’ve been feeling so overwhelmed and exhausted by the weight of them all that I’ve just completely slowed down and found it hard to even make a tiny dent. I get so tired after work that I can barely concentrate (for various reasons, I get very anxious at work; I’m sure many people can relate; deadlines, impostor syndrome, etc).\n\nA few goals, no particular order:\n• Savings\/investment: To achieve enough savings to generate passive income sufficient to cover basic personal expenses over periods of time off work that may be needed in future, in order to pivot my career.\n• Design: Develop knowledge and competence in interaction design and user research in order to improve my effectiveness in developing user interfaces. So far I’ve worked toward this through university study, reading books\/papers, attending meetups\/conferences and lurking in Slack chatrooms.\n• Software Design: Specifically focus on the *design* aspect of software construction, because I find that most interesting and enjoyable. Learning a bit about design patterns, refactoring patterns, testing, algorithms and trying to get better at applying this knowledge in real-life projects at work, not just having it as head-knowledge. Reading books and trying to apply the knowledge and have discussions at my current job is generally how I’m pursuing this.\n• Work: Trying to find high-paying niches for contract work and broaden my offering by learning about cloud and Serverless development. I slacked off a bit on this; had planned to undertake AWS certification, but just got busy with so much other stuff it slipped me by. I’m looking to re-double my efforts and at least achieve AWS Developer certification, if nothing else.\n• Portfolio: Working on a small web application to showcase my skill in user interface design and well designed, quality code. And it might make me a little revenue, who knows?\n• Startups: Very frequently thinking about startup ideas and searching for any kind of niche or idea or field that might be under-developed and a good candidate for creating a startup around. However, these seem to be extremely few and far between. As Mark Andreeson says (paraphrase) “you probably shouldn’t be making a startup; the existing companies that provide that product\/service are probably already very good at it”. These words ring very true. However, in the odd chance I do find a startup opportunity worth pursuing, the savings will help to cover my basic needs for long enough to give it a good hard go.\n• Work in different countries and cultures: I’ve taken a baby-step toward this by moving from Sydney to London; the culture is pretty similar though. I admit I’m terrible with languages, so I’ll probably have to stick to English-speaking. However, I’m researching visas in Ireland, Canada, Singapore, US and other places, and hoping to take up work in some of those places in future. In a globalized world, I want to get exposure to lots of diversity, perspectives and cultures.",
        "user": "UCSJ44X1S",
        "ts": "1548601856.111900",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "eea3d64ffa95",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-12-02\/494422849847_eea3d64ffa95a60795eb_72.png",
            "first_name": "Jonathan",
            "real_name": "Jonathan Conway",
            "display_name": "Jonathan",
            "team": "T5TCAFTA9",
            "name": "jonathan.conway",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UCSJ44X1S",
            "ts": "1548603094.000000"
        },
        "thread_ts": "1548428674.083800",
        "parent_user_id": "UCSJ44X1S",
        "reactions": [
            {
                "name": "sunglasses",
                "users": [
                    "UDJ8A6RNH",
                    "UCXR52MU2"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "45737df9-d43f-43ce-84bd-99e6ca73bcd1",
        "type": "message",
        "text": "<@UDJ8A6RNH> thanks for the podcast recommendation; will check it out.",
        "user": "UCSJ44X1S",
        "ts": "1548602917.112800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "eea3d64ffa95",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-12-02\/494422849847_eea3d64ffa95a60795eb_72.png",
            "first_name": "Jonathan",
            "real_name": "Jonathan Conway",
            "display_name": "Jonathan",
            "team": "T5TCAFTA9",
            "name": "jonathan.conway",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1548428674.083800",
        "parent_user_id": "UCSJ44X1S",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UDJ8A6RNH"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "e960d3e0-afab-4722-b75a-f4679eb7f9ab",
        "type": "message",
        "text": "Would be interested in hearing about anyone else’s goals. Whatever you’d like to share.",
        "user": "UCSJ44X1S",
        "ts": "1548602934.113000",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "eea3d64ffa95",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-12-02\/494422849847_eea3d64ffa95a60795eb_72.png",
            "first_name": "Jonathan",
            "real_name": "Jonathan Conway",
            "display_name": "Jonathan",
            "team": "T5TCAFTA9",
            "name": "jonathan.conway",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1548428674.083800",
        "parent_user_id": "UCSJ44X1S"
    },
    {
        "client_msg_id": "084a571d-fa3d-41d9-901e-99863be1fbcb",
        "type": "message",
        "text": "Maybe I just need a big holiday. :joy:",
        "user": "UCSJ44X1S",
        "ts": "1548621080.113700",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "eea3d64ffa95",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-12-02\/494422849847_eea3d64ffa95a60795eb_72.png",
            "first_name": "Jonathan",
            "real_name": "Jonathan Conway",
            "display_name": "Jonathan",
            "team": "T5TCAFTA9",
            "name": "jonathan.conway",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1548428674.083800",
        "parent_user_id": "UCSJ44X1S",
        "reactions": [
            {
                "name": "laughing",
                "users": [
                    "UCXR52MU2"
                ],
                "count": 1
            }
        ]
    }
]