[
    {
        "client_msg_id": "3d1ca688-21cc-40cd-a93c-b86df072b143",
        "type": "message",
        "text": "I've spent the last fifteen years migrating my personal information system from one software project to another, a few I've used: VoodooPad (a personal favorite), Evernote, Yojimbo, DEVONThink, SimpleNote, Apple Notes, Bear Notes, Ulysses. And probably more I can't think of.\n\nOne important point: I'd never use a web-based system that doesn't have an offline backup for this. I've read way too many horror stories of losing access to web software to do this, here's one: <https:\/\/jaredsinclair.com\/2019\/04\/07\/jekyll-and-hyde.html>\n\nWhat I use now is plain text files on the file system. There are a couple of classic bits of tech writing about this approach: 1. An Alex Payne blog post: <https:\/\/al3x.net\/posts\/2009\/01\/31\/against-everything-buckets.html> 2. The chapter on plain text in the Pragmatic Programmer <https:\/\/pragprog.com\/book\/tpp\/the-pragmatic-programmer>\n\nFor my own notes, if they need to be shared, I put them in a GitHub repo (then I can share the file via the GitHub link, and people can comment, make pull requests to edit, etc...). Otherwise I use any standard sync solution, these days I use Dropbox for stuff I might want to access from computers I don't own, and the built-in iCloud Drive for everything else. I write notes in Markdown.\n\nTo edit my notes I use a text editor. Which one isn't important, but the key feature the text editor needs is to be scriptable, in particular with a way to manipulate text and the file system. You need this in order to write your own features for your system.\n\nFor the most part it's fast to implement your own features on top of plain text and the file system, but, and this is a big but, in order to do this you need to learn how to do two things: 1. Use a scripting language, one that can manipulate text and the file system, for me these are usually Bash and AppleScript, and 2. Extend text editors to add your own features.\n\nBut once you can do those two things, actually adding features and extending your system is really fast. I'd say I average adding a couple of new features a month and they probably take about an hour each.\n\nThe key advantage to this system is its flexibility, since you can write your own features, and you can leverage the decades of existing software that work with plain text and the file system. The number one feature I usually use is Wiki style links, so I can make a Markdown link like for example a todo `- [ ] Do [add a new feature](features\/a-new-feature.md)` then I can follow that link to add more details in another text file.\n\n(For the text editor I usually use Vim these days, except for prose, which I hate writing in Vim, so I use iA Writer or BBEdit for prose. But I've implemented the major features of my system in Vim, Emacs, BBEdit, TextMate, like I said it's not hard once you've learned how to do it.)",
        "user": "UE0ETTCG7",
        "ts": "1561738775.419300",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "2d5718395ee3",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-11-08\/475666469605_2d5718395ee31c13bb5d_72.png",
            "first_name": "Roben",
            "real_name": "Roben Kleene",
            "display_name": "robenkleene",
            "team": "T5TCAFTA9",
            "name": "services",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UE0ETTCG7",
            "ts": "1561739344.000000"
        },
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T",
        "reactions": [
            {
                "name": "cake",
                "users": [
                    "U5STGTB3J"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "19DD5830-AB94-4818-8311-5A6C6946BE35",
        "type": "message",
        "text": "<@UE0ETTCG7> Thanks for the write-up of your process; super interesting! Would you mind sharing a few more things you do frequently that you added to your workflow with custom scripts?",
        "user": "U5STGTB3J",
        "ts": "1561740178.425000",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "649181907e06",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-08-20\/228447816352_649181907e06ec450c64_72.jpg",
            "first_name": "Stefan",
            "real_name": "Stefan Lesser",
            "display_name": "Stefan",
            "team": "T5TCAFTA9",
            "name": "stefanlesser",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T"
    },
    {
        "client_msg_id": "14212224-C711-422D-B649-271DCF41173D",
        "type": "message",
        "text": "It looks like your main use case is to be in front of a computer with access to a keyboard, as is for many people here I think.\n\nI’m finding myself relying more and more on mobile devices to capture thoughts in the moment, so good sync is an absolute must for me, but I’m also wondering what it takes for mobile to become a first-class citizen for note taking workflows?",
        "user": "U5STGTB3J",
        "ts": "1561740196.425200",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "649181907e06",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-08-20\/228447816352_649181907e06ec450c64_72.jpg",
            "first_name": "Stefan",
            "real_name": "Stefan Lesser",
            "display_name": "Stefan",
            "team": "T5TCAFTA9",
            "name": "stefanlesser",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T"
    },
    {
        "client_msg_id": "e0d9a76b-74f1-4a59-8e48-6e491d4d4925",
        "type": "message",
        "text": "Definitely! Here's a few other features I like to do:\n\n- A lot of customizations are around search. I always want to be able to fuzzy find files by name, both relative to the current file, and relative to a root directory. The same for a recursive text search, relative to the current file, and relative to a root directory.\n- Also being able to start custom searches, e.g., two common searches I always  do are looking up code snippets and looking up notes I've made about how to do things in particular software packages (e.g., how to crop something in Photoshop). So I always have quick ways to start those searches.\n- I always have a way to back up the currently selected text. This just saves it to an archive directory with a filename based on the todays date. I think a big reason things get disorganized is people don't have a way to delete stuff they aren't sure they want to get rid of yet, so this is my solution to that.\n- I always have a way convert the selection to title case for nice looking document titles <https:\/\/daringfireball.net\/2008\/05\/title_case>\n- Working with URLs: E.g., if I'm researching a subject I'll make a list of the resources I want to take a closer look at, so I want to be able to select the list of URLs later and open them all in browser tabs.\n- This one is really code specific, but quoting a selection of a file for reference: E.g., generating a link like this from what I have selected in my text editor <https:\/\/github.com\/robenkleene\/Dotfiles\/blob\/master\/scripts\/markdown_wiki_link.sh#L27-L30>",
        "user": "UE0ETTCG7",
        "ts": "1561741881.425400",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "2d5718395ee3",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-11-08\/475666469605_2d5718395ee31c13bb5d_72.png",
            "first_name": "Roben",
            "real_name": "Roben Kleene",
            "display_name": "robenkleene",
            "team": "T5TCAFTA9",
            "name": "services",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "Title Case",
                "title_link": "https:\/\/daringfireball.net\/2008\/05\/title_case",
                "text": "A Perl script for converting a string to capitalized title case.",
                "fallback": "Title Case",
                "thumb_url": "https:\/\/daringfireball.net\/graphics\/df-square-1024",
                "from_url": "https:\/\/daringfireball.net\/2008\/05\/title_case",
                "thumb_width": 1024,
                "thumb_height": 1024,
                "service_icon": "https:\/\/daringfireball.net\/graphics\/apple-touch-icon.png",
                "service_name": "daringfireball.net",
                "id": 1,
                "original_url": "https:\/\/daringfireball.net\/2008\/05\/title_case"
            }
        ],
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T"
    },
    {
        "client_msg_id": "835c0b92-abb9-467a-a544-f8bf077b871f",
        "type": "message",
        "text": "The mobile story with this system is actually pretty good. Spotlight on the iPhone can find files by filename really well if you've configured it correctly. So if I know the name of a file, I can open it in seconds. (This mainly means disabling Spotlight search for everything except the stuff you're actually trying to search for this way).\n\nBut really my process is usually just to use a todo list inbox: I use OmniFocus, but Things does this really well too. No matter what you are looking at on iOS if it has the share icon, you can add it to your inbox with a couple of taps. You can also use 3D touch to instantly jump to adding a note to the inbox. So on mobile, I add links and notes to the inbox, and then process those items once per day at my laptop.\n\nBut going even further, my entire system is possible to do on iOS, since most of my stuff is also synced to a remote server, which I can SSH into with Blink Shell and use my whole system via Vim there. I don't end up doing this very often, I just find it easier to do the processing on a laptop, but it's nice to have in a pinch...",
        "user": "UE0ETTCG7",
        "ts": "1561742547.425700",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "2d5718395ee3",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-11-08\/475666469605_2d5718395ee31c13bb5d_72.png",
            "first_name": "Roben",
            "real_name": "Roben Kleene",
            "display_name": "robenkleene",
            "team": "T5TCAFTA9",
            "name": "services",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T"
    },
    {
        "client_msg_id": "ff9ae6f7-af87-4abb-b263-e93a88a81b55",
        "type": "message",
        "text": "Regarding your point about what mobile needs to be a first class note taking environment, here's the two things it needs for me:\n\n1. A real window manager: Notes go hand in hand with research, and the tiling window manager and single-level of hierarchy for browser tabs on iOS, means it will be worse then macOS for research until that's solved.\n2. Recursive text search: A personal information system lives and dies by search, if you can't do a complex search in order to find specific pieces of information, and be able to process those pieces as your organizational system evolves, then you're just going to end up declaring bankruptcy and starting over once it becomes unwieldily. (One power tool I haven't mentioned is the `cdo` command in Vim, `cdo` allows you to perform a macro on every entry found by a search, this means you can programmatically change the structure of your organizational system, if you don't have a way to do this, then the total amount of information you can manage will always have a cap: The amount of information you're willing to manually update as your needs change.)",
        "user": "UE0ETTCG7",
        "ts": "1561743201.425900",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "2d5718395ee3",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-11-08\/475666469605_2d5718395ee31c13bb5d_72.png",
            "first_name": "Roben",
            "real_name": "Roben Kleene",
            "display_name": "robenkleene",
            "team": "T5TCAFTA9",
            "name": "services",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UE0ETTCG7",
            "ts": "1561743248.000000"
        },
        "thread_ts": "1561232606.230800",
        "parent_user_id": "UJTHWNH2T",
        "reactions": [
            {
                "name": "bulb",
                "users": [
                    "UCUSW7WVD"
                ],
                "count": 1
            }
        ]
    }
]