[
    {
        "client_msg_id": "b50ceca0-00f9-4344-9073-e8bd70829203",
        "type": "message",
        "text": "Hi, all! My name is Nathan Schulzke. I first started programming as a 10-year-old with a copy of Macromedia Flash. Building silly Flash games as a pre-teen doesn't look like much of an educational experience to typical modern educators, but I firmly attribute my success in learning math, logic, and linguistics to early experiments in programming. Because coding was so foundational for me, it has always been surprising and disappointing how few kids get into programming, and how many CS college students find little to no enjoyment in it.\n\nTwo summers ago I taught at a coding camp, which proved to be a turning point for me. I was able to observe in others the same transformation that I went through upon learning programming. I watched kids who thought they were dunces realized they could make the computer do _anything_, which gave them hope and confidence that wasn't there before. But I also observed that the programming curriculum we were given actually got in they way of learning, and only the few kids who were able to ignore the curriculum actually learned to love to code.\n\nThis observation led me to read everything I could find on teaching programming to kids. I read Seymour Papert, Alan Kay, and Brett Victor, and a philosophy of programming education began to take shape. I began to feel that programming could be used to solve critical educational deficits in a lot of kids, if we can only lift our vision above the C-style programming model and treat computing as the wide and varied creative field it can be. I thought I was alone in this line of thinking until the Hillel Wayne podcast ended up on Hacker News. I'm thrilled to find a group so invested in all of my favorite authors, and am excited to learn more!",
        "user": "UJLHTBK0V",
        "ts": "1557597374.115100",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g0a78cf46319",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/60a78cf463197796962b9e1861a29636.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0017-72.png",
            "first_name": "",
            "real_name": "Nathan Schulzke",
            "display_name": "Nathan Schulzke",
            "team": "T5TCAFTA9",
            "name": "nschulzke",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1557597374.115100",
        "reply_count": 4,
        "reply_users_count": 2,
        "latest_reply": "1557877620.145700",
        "reply_users": [
            "UFXFB1RK8",
            "UJLHTBK0V"
        ],
        "replies": [
            {
                "user": "UFXFB1RK8",
                "ts": "1557765084.127000"
            },
            {
                "user": "UJLHTBK0V",
                "ts": "1557773095.129000"
            },
            {
                "user": "UFXFB1RK8",
                "ts": "1557877593.145500"
            },
            {
                "user": "UFXFB1RK8",
                "ts": "1557877620.145700"
            }
        ],
        "is_locked": false,
        "subscribed": false,
        "reactions": [
            {
                "name": "wave",
                "users": [
                    "UJC8ZDSTX",
                    "UFB8STN7K",
                    "U8A5MS6R1",
                    "UBSMEUXAA",
                    "U85HCL7JP",
                    "UFBQNBYER",
                    "U79HM6726",
                    "UJ6LDMMN0",
                    "UHS9K1N6A",
                    "UA14TGLTC",
                    "UJCHWTMH6",
                    "U5TCAFTD3",
                    "UAVCC2X70",
                    "UD6EXQVM0",
                    "UC21F8Q48"
                ],
                "count": 15
            },
            {
                "name": "+1",
                "users": [
                    "UJ6LDMMN0",
                    "UAVCC2X70"
                ],
                "count": 2
            }
        ]
    }
]