[
    {
        "client_msg_id": "bbf035e6-2909-43d1-bde7-7e66ef9192a7",
        "type": "message",
        "text": "I don't know postman that well. As a coder I find there are tons of repetitive tasks. A good editor helps me with those tasks. I can copy and paste from other code. I can search and replace after I've copied. I can regex search and replace or keyboard macro search and replace. In other words, the fact that it's text is a force multiplier.\n\nWhether that fits users of postman I have no idea.\n\nI mostly come from games and an example of frustrating for me would be for example a typical 3D program vs raw code. In draw code I can type\n\n```\n[\n   \"images\/playbutton.jpg\",\n]\n```\n\nAnd then as new buttons are added I can just copy and paste and edit\n\n```\n[\n   \"images\/playbutton.jpg\",\n   \"images\/pausebutton.jpg\",\n   \"images\/rewindbutton.jpg\",\n   \"images\/fastforwardbutton.jpg\",\n   \"images\/stopbutton.jpg\",\n]\n```\n\nThat literally took 10 seconds to edit. Fast enough I it didn't interrupt my flow typing this comment. In many UI environments that ends up being 4x to 16x the work. Pick \"import image\", dialog appear, select image, set a bunch of manual settings, repeat, etc. And, even after I've managed to get all my stuff in the editor I then have to hook them up.\n\nRandom feedback (which probably is not useful but going to throw it out there)\n\nMaya (the 3d package) has a feature that you can select any number of objects and then pull up spreadsheet view showing all their properties. Each row is an object, each column is a property. If one object hasn't have that property it's cell is marked in some way.\n\nIt's in this way you can quickly compare a bunch of properties across object as well as edit them.\n\nI say that's not useful because I think, though I'm not really a Maya user, that not that many Maya users use that feature. I guess I'd have to go ask.\n\nI mostly just bring it up as one example of a way to help power users with UIs that end up getting in their way more than helping.",
        "user": "UC6997THT",
        "ts": "1547474746.023300",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "f3eb3ca69d86",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-08-13\/414472553296_f3eb3ca69d86feb77929_72.png",
            "first_name": "Gregg",
            "real_name": "Gregg Tavares",
            "display_name": "gman",
            "team": "T5TCAFTA9",
            "name": "slack1",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1547078048.014200",
        "parent_user_id": "UEASWGGMR"
    }
]