[
    {
        "client_msg_id": "e25b8320-e75e-4b1e-b118-3a66e8773339",
        "type": "message",
        "text": "Okay guys, I am sick of being told I'm \"bright\" or \"clever\" or \"smart\"... just before I am turned down for a job or, in the case of what happened to me two days ago, fired.\n\nI suspect that the kind of people who don't like me are the same kind of people who are unwilling to explain to my face why they don't like me. Come to think of it, I guess that's just how human culture typically works? But it hurts at lot. So when I was \"laid off\" (their words, but I was definitely fired), I was completely shocked. They briefly explained why, but it went over my head and I immediately forgot the words in the sentences. Something about cultural differences? About how the work environment is \"chaotic\" and my organized, perfectionist style was not acceptable? I sent an email yesterday morning at 3AM saying \"So, respectfully, may I have the explanation repeated?\" but as of yet, no response. One thing I did vaguely remember was what the company's figurehead-leader-of-the-Canadian-subsidiary (not involved in the decision) said something like \"we're looking for people that put in 85% effort, and people that give 110% don't really fit in.\" Hmm, that's probably not exactly how it was worded, but all I can remember with certainty is the numbers 85% (describing a typical\/ideal employee) and 110% (me).\n\nOh well, theoretically that should mean I can look for developer tools jobs to my heart's content... but for the moment I'm too exhausted, owing to a sudden difficulty sleeping.",
        "user": "UD6EXQVM0",
        "ts": "1552175461.016800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g4a9957508aa",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/e4a9957508aa1bdb16018793cfc1bb40.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0020-72.png",
            "first_name": "",
            "real_name": "David Piepgrass",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "qwertie256",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UD6EXQVM0",
            "ts": "1552175891.000000"
        },
        "thread_ts": "1552175461.016800",
        "reply_count": 1,
        "reply_users_count": 1,
        "latest_reply": "1552263175.038000",
        "reply_users": [
            "UCUSW7WVD"
        ],
        "replies": [
            {
                "user": "UCUSW7WVD",
                "ts": "1552263175.038000"
            }
        ],
        "is_locked": false,
        "subscribed": false
    },
    {
        "client_msg_id": "a9c49234-8b1d-49f5-8b3a-ecb7c14f0dab",
        "type": "message",
        "text": "well, in today's world, the HR dept has instructed people never to tell people who are being fired why they were fired, for fear it could backfire in some lawsuit. I find it very lamentable, because it deprives the person being fired of getting very important feedback. I prefer although it is completely out of style, to tell the person to their face exactly why they are so disagreeable or their work habits so objectionable that they must be sacked. Being fired has catapulted many people into fantastic success, as it is such a shock to the system that you can suddenly reinvent yourself. As my father Hamilton used to say, you never know where your help is coming from Of the three guys who used to do the Top Gear show, one of them James May had been fired from a series of jobs. He is now one of the most famous, and beloved, TV personalities in the world. I suspect if you ask a co-worker over a glass of beer they might tell you the real reason. People who row too fast in the boat definitely can cause fear for the slower-rowing people, so maybe you just picked too mediocre a company, and need to find one of the places where people can really throw themselves into their job and do great things.",
        "user": "UEQ6M68H0",
        "ts": "1552180016.022500",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "326328f75c3f",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-02-05\/542651515888_326328f75c3f2a08544c_72.jpg",
            "first_name": "Edward",
            "real_name": "Edward de Jong",
            "display_name": "Edward de Jong \/ Beads Project",
            "team": "T5TCAFTA9",
            "name": "magicmouse94937",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UEQ6M68H0",
            "ts": "1552180106.000000"
        },
        "reactions": [
            {
                "name": "point_up",
                "users": [
                    "UA14TGLTC",
                    "UCXR52MU2",
                    "UHDQ62M4P"
                ],
                "count": 3
            },
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "UE6EFEPTQ",
                    "U8A5MS6R1",
                    "UCXR52MU2"
                ],
                "count": 3
            }
        ]
    },
    {
        "client_msg_id": "80fa4507-9437-4845-91ad-0d28e643404e",
        "type": "message",
        "text": "Groups of humans are on some level still just troops of hominids on the savannah. There are many ways to not fit in, and the penalty for not fitting in is the same (being cast out), and the group doesn't really have good self-awareness of where the misfit lay. And why does it have to be _you_ that needs to change and needs feedback?\n\nThe good news is that there's one major way we _aren't_ like hominids on the savannah: there are lots of groups out there, in dazzling varieties. Just forget the experience, stop trying to learn from it, find another group to join.\n\n(And another, and another, and another. Some people have a better fit with the larger population than others. But the strategy doesn't change. Try to forget the past, and treat each new group as the first.)",
        "user": "UCUSW7WVD",
        "ts": "1552180752.031800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "6e649a383cf8",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-07-14\/687915485201_6e649a383cf8f9e366e3_72.png",
            "first_name": "Kartik",
            "real_name": "Kartik Agaram",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "ak",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UCUSW7WVD",
            "ts": "1552260817.000000"
        },
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UA14TGLTC",
                    "UE6EFEPTQ",
                    "UBAP530VB",
                    "UCXR52MU2"
                ],
                "count": 4
            }
        ]
    },
    {
        "client_msg_id": "28b99532-211b-4936-8172-560433c0c4f7",
        "type": "message",
        "text": "<@UD6EXQVM0> Sorry to hear about that. I think I've been on both sides of this sort of thing. Sometimes it's hard to articulate exactly why it's not meshing with a particular personality and you just gotta make a decision and move forward even if you can't 100% justify it. Would you say you approach your professional work with the attitude that you're there to take the things that are important to your employer\/boss and make them important to you even if it isn't clear why they're important to your employer?",
        "user": "UD4Q9LT52",
        "ts": "1552204588.035600",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "7af440990a8e",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-03-03\/565459439473_7af440990a8e3cbe92ff_72.jpg",
            "first_name": "Jake",
            "real_name": "Jake Brownson",
            "display_name": "Jake Brownson",
            "team": "T5TCAFTA9",
            "name": "jbrownson",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1552204588.035600",
        "reply_count": 3,
        "reply_users_count": 2,
        "latest_reply": "1552276609.038200",
        "reply_users": [
            "UD6EXQVM0",
            "UD4Q9LT52"
        ],
        "replies": [
            {
                "user": "UD6EXQVM0",
                "ts": "1552222033.035700"
            },
            {
                "user": "UD6EXQVM0",
                "ts": "1552222796.036200"
            },
            {
                "user": "UD4Q9LT52",
                "ts": "1552276609.038200"
            }
        ],
        "is_locked": false,
        "subscribed": false
    }
]