[
    {
        "client_msg_id": "0c484e48-8ce4-4872-afd1-e46d04710cbc",
        "type": "message",
        "text": "Not quite the same idea, but there have been a few \"Autocomplete from Stack Overflow\" projects. Here's one: <https:\/\/emilschutte.com\/stackoverflow-autocomplete\/>",
        "user": "UC2A2ARPT",
        "ts": "1534187563.000068",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gf94d2ed5e18",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/6f94d2ed5e188be9865a531021b0afcd.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Ivan",
            "real_name": "Ivan Reese",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "ivanreese",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1533936262.000247",
        "parent_user_id": "U85HCL7JP"
    },
    {
        "client_msg_id": "01992e1f-4958-4580-af63-7be793dee24b",
        "type": "message",
        "text": "It feels like your idea is almost the reverse, though. I imagine a programming tool where you write unit tests, submit them to Mechanical Turk, and get back code that satisfies the tests. I wonder how [in]efficient that'd be, in an economic sense. (I wouldn't be at all surprised if there has already been an ICO for a service that does something like this.)",
        "user": "UC2A2ARPT",
        "ts": "1534187757.000390",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gf94d2ed5e18",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/6f94d2ed5e188be9865a531021b0afcd.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Ivan",
            "real_name": "Ivan Reese",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "ivanreese",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1533936262.000247",
        "parent_user_id": "U85HCL7JP"
    },
    {
        "client_msg_id": "f7f0af9c-2afc-4417-b471-2f3ddd09d46e",
        "type": "message",
        "text": "I've found it most essential to have a reasonably well-bounded end state. You can't \"win\" if you don't know what winning is. Whether it's some idea that I want reify (or find out of someone else has already realized it), or it's a particular pain that my company (or society\/civilization) is feeling that I'd like to remove, or something I want to learn just to keep abreast of technology and our culture, I think it's key to define a goal condition for your research-like activity, as specifically as you can manage.\n\nA really helpful yardstick I've found when approaching learning material (papers, blog posts, talks, books, etc) is to determine if something is or isn't going to be *pabulum* — intellectual, thought-provoking, informative, but ultimately bland and _entertaining_ to me, rather than _helpful_ to me. This is a very difficult determination to make in the absence of a specific goal.\n\nI also find it's valuable to do whatever I can to make sure I'm highly excited about what I'm working on. That might be a luxury not everyone can afford, but I think we're all here in this Slack because of some measure of mutual passion, so I think it's safe to take this value as a given here. Enthusiasm is what determines how I structure my time at a fine-grained level — \"What small step toward my end goal am I most excited about taking next?\" The pabulum filter + specific end goal keeps me from treading water, while this \"chase your curiosity\" approach keeps the work from becoming monotonous. One day I might make a paper prototype. Then I might decide that paper lacks \"liveness\", so I grab a stop-motion app and make an animated paper prototype. Then I might decide that I really need to interact with the system, so I ask my wife to help me \"act out\" the HCI, moving the paper pieces around according to some ruleset. After refining the ruleset, I have something structured enough to prototype in Keynote or hypertext. In each of these steps, I'm doing work that I need to do, but in a way that keeps me away from writing code, since today I'm less excited about writing code than I am about (say) scissors.\n\nThat's my recipe.\n* Be excited to go somewhere.\n* Be sure you're always moving in that direction.\n* And be absolutely sure there's a \"there\" there.",
        "user": "UC2A2ARPT",
        "ts": "1534191436.000384",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gf94d2ed5e18",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/6f94d2ed5e188be9865a531021b0afcd.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Ivan",
            "real_name": "Ivan Reese",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "ivanreese",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UC2A2ARPT",
            "ts": "1534196007.000000"
        },
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U8A5MS6R1",
                    "UA14TGLTC",
                    "UAL7940NM"
                ],
                "count": 3
            }
        ]
    },
    {
        "client_msg_id": "526c9842-9f84-4c34-9d77-c3c4aad76596",
        "type": "message",
        "text": "At around 52 minutes, he starts hammering on \"Conveyance\" and I almost did a spit-take. One of the ways I've been thinking about my current project is as a \"conveyance-oriented programming language\". Unfortunately (or thankfully?), the meaning of conveyance he's using is slightly different from the one I'm using, so I don't think they'll be any toe-stepping going on here.\n\nRegardless, this is an awesome talk.",
        "user": "UC2A2ARPT",
        "ts": "1534202350.000231",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gf94d2ed5e18",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/6f94d2ed5e188be9865a531021b0afcd.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Ivan",
            "real_name": "Ivan Reese",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "ivanreese",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UC2A2ARPT",
            "ts": "1534202405.000000"
        },
        "thread_ts": "1509242577.000082",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "d6eb8f7a-9937-40c9-a3f4-c28851e01116",
        "type": "message",
        "text": "Great question from <@U5STGTB3J> that I'm interested in as well. There's good advice from <@UC2A2ARPT> . I'm mostly stuck around framing\/phrasing the problem I'm hoping to solve. I've found some things that *seem like* progress, at least. One is ways to filter and keep track of papers etc. using skimming and highlighting of key phrases in some annotation system (I use <http:\/\/hypothes.is|hypothes.is>). The key phrases are ones that are either insights or things I clearly disagree with - so skimming the highlights kind of tells me when and if I want to read more. The other thing is just writing - I keep a semi-organized notes (some sections and sub-sections) with ideas etc that just pop into my head at any time or when reading any material. Every so often I try to do a review and reorg of the notes and sometime I also do a proper write-up of some topic, pulling from my notes. This helps me feel that something is 'processed' and not have to spin that stuff in my head again. I don't really have research 'days' because I only find scattered time here and there.",
        "user": "U8A5MS6R1",
        "ts": "1534211272.000069",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "b7c63cc07373",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-03-21\/584465935395_b7c63cc07373326ec6ea_72.jpg",
            "first_name": "Shalabh",
            "real_name": "Shalabh Chaturvedi",
            "display_name": "shalabh",
            "team": "T5TCAFTA9",
            "name": "shalabh.chaturvedi",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]