[
    {
        "client_msg_id": "9806e646-5c89-44b3-a79b-fdff2712102e",
        "type": "message",
        "text": "I feel like I've seen this before.  I mean Mercury OS specifically, not just, say a flow view which is like Glamorous Toolkit and many other things to be sure.  I love the general notion of organizing things on screen around activities\/workflow primarily.  Many system allow this (often accidentally) but too many try their best to prevent it.  In short, apps suck.  :crying_cat_face:",
        "user": "UA14TGLTC",
        "ts": "1559286468.007600",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gae6d55db9d1",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/3ae6d55db9d15b79bc683a8031fc2588.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0009-72.png",
            "first_name": "",
            "real_name": "William Taysom",
            "display_name": "wtaysom",
            "team": "T5TCAFTA9",
            "name": "wtaysom",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1559190299.000300",
        "parent_user_id": "U8A5MS6R1"
    },
    {
        "client_msg_id": "b933604c-1932-41c3-aec9-f8c1c5a33cde",
        "type": "message",
        "text": "Maybe I'm missing it. This looks like OLE (Object Linking and Embedding) from Microsoft Windows 3.1-ish days. in the mid 90s. You could put one app's output embedded live any other app that supported it.\n\nIt turned out to be a horrible idea. One problem was the UI required for each activity conflicted with the UI used for the overall app.\n\nTo put it another way, when I'm serious about editing an image I want the 1000s of options of Photoshop or Lightroom. When I'm serious about making a diagram I want Omnigraffle or Illustrator. When I'm serious about 3D I want the 5000 features of Blender or Maya. When I'm serious about spreadsheets I want Excel. etc...  These apps that claim to put it all together have the most basic of features. I can pop a drawing into my \"document\" and I get the \"notepad\" of drawing programs to work on it with.\n\nThere were other UI issues as well. Embed a 1024x768 image in your document and clicking on it there might be room for the UI. Embed a 64x64 pixel image and suddenly that failed completely. At some level you need both UIs. The UI that lets you edit the image\/3d\/diagram and the UI that lets you pop out to the containing document.\n\nEven with separate apps (so the UI is separate) and just using the linking portion turned out to be a huge problem as then you get the combinatorial problems of having all the apps have version issues so you load up some containing document which links to data from 4 other apps. All those apps need to be loaded to display their embedded data.\n\nOf course you might say the apps should display some generic representation which is fine but then you still run into the issue that the moment the user clicks on that data the want the app to be able to edit it and put it back in.\n\nFurther, outside of basically unformatted text and simple bitmaps most formats are unique and there is no translation between them because they actually support different features. A simple example would be one app might represent a circle and a center and a radius. Another app might represent a circle as the min and max extents which is more flexible. Can do ellipses. There is no easy translation between the 2. Going from ellipse supporting app to only circle supporting app requires adding some kind of scale node assuming circle supporting app supports scale node. Going back is now lossy. There's no way to know did the user start with an only an ellipse or did they have an ellipse as a child of some scaled group.\n\nThis kind of issue of structure data is yet another reason why this type of thing doesn't work in practice. As another example there are hundreds of Photoshop features not found in gIMP so if you embed a Photoshop image what's supposed to happen when someone tries to edit that elsewhere?",
        "user": "UC6997THT",
        "ts": "1559296867.007800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "f3eb3ca69d86",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-08-13\/414472553296_f3eb3ca69d86feb77929_72.png",
            "first_name": "Gregg",
            "real_name": "Gregg Tavares",
            "display_name": "gman",
            "team": "T5TCAFTA9",
            "name": "slack1",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1559190299.000300",
        "parent_user_id": "U8A5MS6R1"
    },
    {
        "client_msg_id": "ad1a11e1-9bab-418c-b26a-2723e82c6c12",
        "type": "message",
        "text": "OLE had a crazy-a API though!  There's an in-the-middle level of integration.  We'd benefit more from a window manager plus limited links... and oh... oh dear... I'm getting close to describing Acme <http:\/\/doc.cat-v.org\/plan_9\/4th_edition\/papers\/acme\/>.",
        "user": "UA14TGLTC",
        "ts": "1559297335.008000",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gae6d55db9d1",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/3ae6d55db9d15b79bc683a8031fc2588.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0009-72.png",
            "first_name": "",
            "real_name": "William Taysom",
            "display_name": "wtaysom",
            "team": "T5TCAFTA9",
            "name": "wtaysom",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1559190299.000300",
        "parent_user_id": "U8A5MS6R1"
    },
    {
        "client_msg_id": "ef100541-8dee-49d2-bb2a-0384416d8995",
        "type": "message",
        "text": "OLE failed IMO because that kind of rich integration cannot be retro-fitted. Once you start with apps you're already stuck to whatever interchange mechanisms exists - libraries, files etc. To do something different you start from the new idea and you don't have 'apps' but other entities (objects\/views?) that live and conform to the environmental constraints.",
        "user": "U8A5MS6R1",
        "ts": "1559342354.008400",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "b7c63cc07373",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-03-21\/584465935395_b7c63cc07373326ec6ea_72.jpg",
            "first_name": "Shalabh",
            "real_name": "Shalabh",
            "display_name": "shalabh",
            "team": "T5TCAFTA9",
            "name": "shalabh.chaturvedi",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1559190299.000300",
        "parent_user_id": "U8A5MS6R1",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UCUSW7WVD",
                    "UDJ2TKB99"
                ],
                "count": 2
            }
        ]
    }
]