[
    {
        "client_msg_id": "ab460ef2-4204-4bd0-8af6-91f95e746632",
        "type": "message",
        "text": "Also this 2017 arXiv-only paper from MSR: “SMARTPASTE: Learning to Adapt Source Code” Allamanis and Brockschmidt <https:\/\/arxiv.org\/pdf\/1705.07867.pdf>\n&gt; Deep Neural Networks have been shown to succeed at a range of natural language tasks such as machine translation and text summarization. While tasks on source code (ie, formal languages) have been considered recently, most work in this area does not attempt to capitalize on the unique opportunities offered by its known syntax and structure. In this work, we introduce SmartPaste, a first task that requires to use such information. The task is a variant of the program repair problem that requires to adapt a given (pasted) snippet of code to surrounding, existing source code. As first solutions, we design a set of deep neural models that learn to represent the context of each variable location and variable usage in a data flow-sensitive way. Our evaluation suggests that our models can learn to solve the SmartPaste task in many cases, achieving 58.6% accuracy, while learning meaningful representation of variable usages.",
        "user": "UC21F8Q48",
        "ts": "1566324567.180200",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "d79ba47b2952",
            "image_72": "https:\/\/avatars.slack-edge.com\/2018-08-03\/410049852848_d79ba47b2952e74a99d9_72.jpg",
            "first_name": "Brian",
            "real_name": "Brian Hempel",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "brianhempel",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UC21F8Q48",
            "ts": "1566324599.000000"
        },
        "thread_ts": "1565465672.172300",
        "parent_user_id": "UFB8STN7K"
    }
]