[
    {
        "client_msg_id": "a99353f3-0cbe-4087-8f47-14c7627dead8",
        "type": "message",
        "text": "Kinda funny: <https://aiweirdness.com/post/634684907050909696/what-to-do-with-your-time>",
        "user": "UCUSW7WVD",
        "ts": "1605284276.085100",
        "team": "T5TCAFTA9",
        "attachments": [
            {
                "service_name": "AI Weirdness",
                "title": "What to do with your time",
                "title_link": "https://aiweirdness.com/post/634684907050909696/what-to-do-with-your-time",
                "text": "In Leonardo DaVinci’s diary you can find his to-do lists, the kinds of broad-ranging investigations the famous polymath would use to occupy his time: Draw Milan. Get the master of arithmetic to show you how to square a triangle Ask Giannino the Bombardier about how the tower of Ferrara is walled Why is the fish in the water swifter than the bird in the air when it ought to be the contrary since the water is heavier and thicker than the air? Describe the tongue of the woodpecker. But since DaVinci has already done all that, and we’re all not busy enough (pause to stare at camera) clearly we need new things to do. Blog reader Emily Davis suggested getting a neural net to generate more to-do items for the modern DaVinci. I prompted GPT-3 with 9 items from DaVinci’s to-do lists, and here are some of the highlights: GPT-3 did seem to know that it was generating DaVinci content - often it would finish the list of to-do items with a pronouncement on DaVinci’s legacy, and many of its suggestions were plausible: “Get the friar minor to tell me what is the best time to water a plant or tree.” “Get Maestro Leonardo Fioravanti of Bologna to tell me the measurements of the world and the distances between the stars.” To get GPT-3 to add giraffes to the list, I had to set things up so that GPT-3 thought it was completing a blog post in which a giraffe-obsessed neural net had generated DaVinci to-do items. It’s all very meta, but it worked! I collected the rest of them in a bonus post, which you can get by signing up here. My book on AI, You Look Like a Thing and I Love You: How Artificial Intelligence Works and Why it’s Making the World a Weirder Place, is available wherever books are sold: Amazon - Barnes &amp; Noble - Indiebound - Tattered Cover - Powell’s - Boulder Bookstore",
                "fallback": "AI Weirdness: What to do with your time",
                "from_url": "https://aiweirdness.com/post/634684907050909696/what-to-do-with-your-time",
                "service_icon": "https://64.media.tumblr.com/avatar_750f25d27690_128.pnj",
                "id": 1,
                "original_url": "https://aiweirdness.com/post/634684907050909696/what-to-do-with-your-time"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "2tv0P",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Kinda funny: "
                            },
                            {
                                "type": "link",
                                "url": "https://aiweirdness.com/post/634684907050909696/what-to-do-with-your-time"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]