[
    {
        "client_msg_id": "FE8DC2DF-BE94-4E14-A9B3-09C5789BC9AF",
        "type": "message",
        "text": "<@ULM3U6275> I'm glad we’re on the same page about the fuzziness of that question. I appreciate you trying to make this specific, but it sets us up for misunderstanding if our interpretations differ (which they likely will). With that disclaimer, here a few things that came to my mind while pondering about how to respond to your question:\n\nI think the original VPRI STEPS project was an appropriately (good) scoped and defined (design) research project. It had a very specific albeit pragmatic goal (&lt;20k LOC) that all the research could be aligned towards. I don’t know about many FoC projects that are as bold to limit their scope that aggressively. I wish there was a STEPS2020 project that is similar in spirit, but perhaps focused on a smartphone as a platform instead.\n\nBret Victor's early demos are good examples for tastefully (good) designed interactions for tools. I'm leaning towards the future of programming is (a) for everyone (what some call “end-users”) and (b) will likely not be called coding or programming, and his early demos point roughly in that direction with their focus on immediate feedback. That we tolerate a horribly slow feedback loop with “simulating computation in our heads” is still the main difference between us programmers and people who “just use” computers.\n\nAs will not surprise you, I am very bullish on the Swift programming language. I think it's exceptionally well architected for the changing requirements of the future device landscape (e.g. <https://gankra.github.io/blah/swift-abi/>). I believe your project can’t be designed for the _future_ of programming, if you only consider interaction modes from the _past_, like keyboard and pointing device.\n\nI like what Andy Matuschak and Michael Nielsen are doing (<https://numinous.productions/ttft/>). Some might say it's a little outside the scope of FoC. I’d say it’s right at the center of it.\n\nNicky Case (<https://ncase.me/>) is a great example for someone who knows how to program today and does great things with that knowledge. I often think one big achievement of a FoC project could be to end up with more people like Nicky, enabling them to publish similar things, but without having to know nearly as much about programming.\n\nNot sure if any of this is remotely what you were looking for. At least it was a good exercise for me to think more clearly about it.",
        "user": "U5STGTB3J",
        "ts": "1573427174.320500",
        "team": "T5TCAFTA9",
        "attachments": [
            {
                "title": "How can we develop transformative tools for thought?",
                "title_link": "https://numinous.productions/ttft/",
                "text": ":hammer_and_wrench::brain::lower_left_paintbrush::boom::earth_americas::sparkles::soon:",
                "fallback": "How can we develop transformative tools for thought?",
                "image_url": "https://numinous.productions/ttft/assets/social.png",
                "image_width": 500,
                "image_height": 250,
                "from_url": "https://numinous.productions/ttft/",
                "image_bytes": 171568,
                "service_name": "numinous.productions",
                "id": 1,
                "original_url": "https://numinous.productions/ttft/"
            },
            {
                "title": "Nicky Case",
                "title_link": "https://ncase.me/",
                "text": "It's Nicky Case!",
                "fallback": "Nicky Case",
                "image_url": "https://ncase.me/social/thumbnail.png",
                "from_url": "https://ncase.me/",
                "image_width": 459,
                "image_height": 250,
                "image_bytes": 15413,
                "service_icon": "https://ncase.me/favicon.png",
                "service_name": "ncase.me",
                "id": 2,
                "original_url": "https://ncase.me/"
            }
        ],
        "thread_ts": "1572759144.037500",
        "parent_user_id": "UC2A2ARPT",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "ULM3U6275",
                    "UJ6LDMMN0"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "877d2470-0ac0-4997-aa4c-9644f51ba9a0",
        "type": "message",
        "text": "Visual bootstrap was mindbending.",
        "user": "UCUSW7WVD",
        "ts": "1573433309.321600",
        "team": "T5TCAFTA9",
        "thread_ts": "1573223635.237700",
        "parent_user_id": "UJN1TAYEQ",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UMVFWPZ36",
                    "UHWC9PXBL"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "b28c47b2-0c9b-4b72-b636-ff4446d12662",
        "type": "message",
        "text": "Am sure Hillel Wayne will learn the answer to this, as he does a lot of reading. IBM have done a lot of work on this topic and already have very good solutions that not only solve the problem, but also reduce development time. ... software inspection by Tom Gilb is a good starting point. The exercises in a discipline for software engineering are like gold, but the book wants an editor.",
        "user": "UP6G25H35",
        "ts": "1573441660.322000",
        "team": "T5TCAFTA9",
        "thread_ts": "1568644207.175000",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "2c650002-fd2e-4173-b910-304c4a692927",
        "type": "message",
        "text": "I think in the area of software engineering, it isn't that we don't know what works; frankly we know a ton about what works. It is just that the senior developers are not honored and imitated. Few seek out masters to study from, they consider the older programmers obsolete. Looking at the industry from a bird's-eye view, the average experience level is dropping due to the larger number of new programmers. Programming is a great deal more like basket weaving than most would like to admit. Lots of repetitive actions, and the skill lies in knowing the exact optimum sequence in which to construct a large product. The most important factor in productivity is knowing the proper sequence in which to build, so that you minimize the number of things changing at once. Biological systems are built this way; a layer added at the boundary, so that it can be verified easily; never 10 things at once which in the case of programming creates uncertainty as to where the problem lies. This is why the fanatic testers do have some advantages over the non-testers; the practice of making the test means they are building sturdiness as they proceed. When you see big team projects fail over and over, it is almost always because they are changing 100 things at once, which creates total chaos. This is why we have so few large projects attempted and instead many projects on GitHub are actually mashups, and many of these mashups have a frightening number of dependencies. In every company i worked for we fought hard against dependencies, because robustness is impossible above a certain complexity. Just look at the endless bugs in MS Windows and OSX to see examples of good teams being incapable of creating robust software.",
        "user": "UEQ6M68H0",
        "ts": "1573458008.322300",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UEQ6M68H0",
            "ts": "1573532640.000000"
        },
        "thread_ts": "1568644207.175000",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "abdcaaa4-5420-4c54-8c11-8087b35e3090",
        "type": "message",
        "text": "Podcast idea: <@U5TCAFTD3>\n\nRob Fitzpatrick,  lost over $1 million USD. He has bankrupted 3 businesses. Because he did not know how to do user stories.\n\nThe same is true for Microsoft, read Microsoft secrets, they had the same problem and used the same solution back in the 1990's.\n\nHe has a book \"The Mom Test\". I assume he is happy to do an interview in exchange for a plug of the book.\n\nVideo of him talking about the problem and solution. He says you should ask questions about current solutions. <https://www.youtube.com/watch?v=0LwbFZkyRKk>\n\nNot sure if the topic is right for the pod cast. But feel that the problem he describes and the solution are important to trying to make programming more accessible.",
        "user": "UP6G25H35",
        "ts": "1573460953.323600",
        "team": "T5TCAFTA9",
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https://www.youtube.com/",
                "title": "Rob Fitzpatrick - How to Learn from Customers When Everyone is Lying to You",
                "title_link": "https://www.youtube.com/watch?v=0LwbFZkyRKk",
                "author_name": "StartUP Foundation",
                "author_link": "https://www.youtube.com/channel/UC4pZ4MuLc6nv_AGJoCv9wRA",
                "thumb_url": "https://i.ytimg.com/vi/0LwbFZkyRKk/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: Rob Fitzpatrick - How to Learn from Customers When Everyone is Lying to You",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https://www.youtube.com/embed/0LwbFZkyRKk?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https://www.youtube.com/watch?v=0LwbFZkyRKk",
                "service_icon": "https://a.slack-edge.com/80588/img/unfurl_icons/youtube.png",
                "id": 1,
                "original_url": "https://www.youtube.com/watch?v=0LwbFZkyRKk"
            }
        ],
        "thread_ts": "1573460953.323600",
        "reply_count": 4,
        "reply_users_count": 4,
        "latest_reply": "1575958315.255700",
        "reply_users": [
            "UEQ7QL15F",
            "U5TCAFTD3",
            "UHWC9PXBL",
            "UP6G25H35"
        ],
        "subscribed": false,
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "UHWC9PXBL"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "b88e20ac-c9c6-4edd-adce-de5c585a4a2d",
        "type": "message",
        "text": "Thank you so much <@U5TCAFTD3> for asking this question <https://twitter.com/stevekrouse/status/1193468765880668160>",
        "user": "UJFN50C00",
        "ts": "1573462308.324200",
        "team": "T5TCAFTA9",
        "attachments": [
            {
                "fallback": "<https://twitter.com/stevekrouse|@stevekrouse>: What's YOUR excuse for not doing more to fight climate change?",
                "ts": 1573380102,
                "author_name": "Steve Krouse",
                "author_link": "https://twitter.com/stevekrouse/status/1193468765880668160",
                "author_icon": "https://pbs.twimg.com/profile_images/920962798590595074/MHJaRnhd_normal.jpg",
                "author_subname": "@stevekrouse",
                "text": "What's YOUR excuse for not doing more to fight climate change?",
                "service_name": "twitter",
                "service_url": "https://twitter.com/",
                "from_url": "https://twitter.com/stevekrouse/status/1193468765880668160",
                "id": 1,
                "original_url": "https://twitter.com/stevekrouse/status/1193468765880668160",
                "footer": "Twitter",
                "footer_icon": "https://a.slack-edge.com/80588/img/services/twitter_pixel_snapped_32.png"
            }
        ],
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U5TCAFTD3"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "a411b2dc-7a31-4b51-813a-af35ab3afb73",
        "type": "message",
        "text": "It puts the finger in a very vulnerable spot. As you could see by the responses. Many people seem have problems relating our even listening .",
        "user": "UJFN50C00",
        "ts": "1573462446.325800",
        "team": "T5TCAFTA9"
    },
    {
        "client_msg_id": "c891d56e-f45f-4731-ba1f-0bc6b6a72eea",
        "type": "message",
        "text": "Thanks for sharing, haven’t watched the video yet. Asking questions about the current solutions of users and understanding their problems is very much in the core of user (UX) research.\n\nI’ve worked with perhaps 20 product companies and I think one of the largest risks they are taking is not doing enough research.",
        "user": "UEQ7QL15F",
        "ts": "1573462935.328300",
        "team": "T5TCAFTA9",
        "thread_ts": "1573460953.323600",
        "parent_user_id": "UP6G25H35"
    },
    {
        "client_msg_id": "8f7989df-b044-4cbe-841c-d0132c66f686",
        "type": "message",
        "text": "It seems to me like almost the computer scientists can not believe or relate to the climate scientists",
        "user": "UJFN50C00",
        "ts": "1573463046.329100",
        "team": "T5TCAFTA9"
    },
    {
        "client_msg_id": "fcd17db3-aa6c-44bd-ad92-4ca4640ca1c1",
        "type": "message",
        "text": "<@UJFN50C00>: We have a <#C5U3SEW6A|random> channel for off-topic stuff (although it gets used almost exclusively for on-topic stuff, for some reason.. :smile: )",
        "user": "UE6EFEPTQ",
        "ts": "1573463699.330100",
        "team": "T5TCAFTA9",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U5TCAFTD3"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "de8fc093-0255-4560-96a7-493766cab8fa",
        "type": "message",
        "text": "<@U5STGTB3J> Thanks, it’s interesting to hear your thoughts on it. When I talk about design, it’s usually about aesthetics (which includes look&amp;feel aka UI&amp;UX). What’s curious to me is that if you look at any list of projects related to visual programming, almost all (at least IMO) have visual designs that are cluttered and confused and generally break every rule of good design. I’m guessing this is because these are mostly programmers diving into the world of visual design, instead of visual designers getting into programming. Maybe more collaboration from people on both sides would be helpful, but I don’t know if there’s an awareness that these designs need help.",
        "user": "ULM3U6275",
        "ts": "1573493707.330400",
        "team": "T5TCAFTA9",
        "thread_ts": "1572759144.037500",
        "parent_user_id": "UC2A2ARPT",
        "reactions": [
            {
                "name": "100",
                "users": [
                    "UC2A2ARPT"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "3DB5B248-7DD8-4B43-9761-BE038C559268",
        "type": "message",
        "text": "<@ULM3U6275> You’re pretty much describing the situation with mobile apps as well. Tons of developers try to build apps, few work with designers.\n\nYou’re also touching on a related problem: many people think design is just visual aesthetics. That is for sure a part of it, but user experience means a lot more.\n\nNow that most regular people most of the time use pocket-sized supercomputers with touchscreens and all kinds of other sensors, how it feels becomes more important. Animations, fluid transitions, direct manipulation, continuous gestures, physicality, feedback, and integration become more important and will distinguish good design from great design, until what used to be considered good feels broken.\n\nA typical use case for me is having four to six small computers, several of them wearable, on me and actively using them simultaneously. That’s phone, watch, two wireless headphone earpieces, and sometimes a tablet with a pencil all working in concert together. I skip a track by tapping on my watch although the music is actually playing on my phone and streamed to my headphones. The music stops playing when I remove one of the earpieces and continues by just putting it back in. I copy something on my phone and paste it on my tablet or notebook. There's not much visual UI involved, but that’s user experience.\n\nThere is a ton of potential in this kind of integration across devices. But people still discuss whether tablets are going to replace notebooks, like the web will finally make apps obsolete any day now. ;-)",
        "user": "U5STGTB3J",
        "ts": "1573498521.339700",
        "team": "T5TCAFTA9",
        "thread_ts": "1572759144.037500",
        "parent_user_id": "UC2A2ARPT"
    },
    {
        "client_msg_id": "c2d66f9d-b4b5-443a-8de2-9f50881253fe",
        "type": "message",
        "text": "I'm glad this thread happened— it's this discussion that has prompted me to switch Lynx to quad precision floats (which LLVM supports: <https://llvm.org/doxygen/group__LLVMCCoreTypeFloat.html#ga1c02fb08f9ae12a719ed42099d42ccd8>). Other numerical types will be supported eventually, but this will fend off users from having to understand and distinguish the difference between an integer and a real, which they really shouldn't have to worry about. A 112 bit mantissa is more than enough to count anything, and should also be enough to do finance calcs in any reasonable currency.",
        "user": "U6FKVSVCK",
        "ts": "1573499356.339900",
        "team": "T5TCAFTA9",
        "thread_ts": "1571172258.364800",
        "parent_user_id": "UJN1TAYEQ"
    },
    {
        "client_msg_id": "7387f5cc-5afd-4afe-9fd5-8a547d43b283",
        "type": "message",
        "text": "<@U5STGTB3J> If it’s true that visual aesthetics, user experience, and systems design are all related to experiential sensitivity, then those insensitive to unnecessary complexity in one, may be more likely to have a similar blind spot in the others.",
        "user": "ULM3U6275",
        "ts": "1573511195.340400",
        "team": "T5TCAFTA9",
        "thread_ts": "1572759144.037500",
        "parent_user_id": "UC2A2ARPT",
        "reactions": [
            {
                "name": "cake",
                "users": [
                    "UC2A2ARPT"
                ],
                "count": 1
            }
        ]
    }
]