[
    {
        "client_msg_id": "ef3c7c86-b759-4e0b-83dd-12b689ce0310",
        "type": "message",
        "text": "I find the whole conversation about changelogs, and fancy source control to be depressing. If Tolstoy who wrote War &amp; Peace, one of the greatest books ever written entirely in longhand, can create a complex, threaded story, without worrying about backtracking, why is it that people are so interested in what the code used to be? That isn't productivity, source control is about damage control from people breaking stuff who can't understand the implications of the changes they are making, because stuff is too tightly interconnected. In my system i am striving for super-compartmentalization, so that changes don't ripple throughout the system, and have unseen, unpredictable consequences. CSS is my poster child for unpredictable results from small changes. I think CSS is the most devilish thing ever devised in computers, one of the primary motivations for my development efforts is my extreme distaste for CSS.\n\nAnyway, if you can author sequentially, and the computer turns it into recursion, and depth-first\/breadth-first searches, and automatic sorting, with no joins or tricky concepts, it should be possible for individuals to write large products with no stress.\n\nI always found that programs with no branches and a straight down flow were easy to program. So the goal is to have zero IF statements, and linear flow. Let the computer do the tricky bit of  re-sequencing. That is the goal.",
        "user": "UEQ6M68H0",
        "ts": "1554538051.056800",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "326328f75c3f",
            "image_72": "https:\/\/avatars.slack-edge.com\/2019-02-05\/542651515888_326328f75c3f2a08544c_72.jpg",
            "first_name": "Edward",
            "real_name": "Edward de Jong",
            "display_name": "Edward de Jong \/ Beads Project",
            "team": "T5TCAFTA9",
            "name": "magicmouse94937",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "UEQ6M68H0",
            "ts": "1554539072.000000"
        },
        "thread_ts": "1554420137.022100",
        "parent_user_id": "UAVCC2X70"
    }
]