[
    {
        "client_msg_id": "5b079729-da84-4886-a96f-553f2ad22b89",
        "type": "message",
        "text": "The Meaning of Live: From Art Without Audience to Programs Without Users with Julian Rohrhuber and Renate Weiser\n<https://zenodo.org/record/7843567>\n\nIt includes critique of what we saw as the common approach to 'liveness' in future of coding community. We explain ways in which live debugging is the opposite of live coding.",
        "user": "U05SU27S1M2",
        "ts": "1695462160.838209",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "+z=Y",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "The Meaning of Live: From Art Without Audience to Programs Without Users with Julian Rohrhuber and Renate Weiser\n"
                            },
                            {
                                "type": "link",
                                "url": "https://zenodo.org/record/7843567"
                            },
                            {
                                "type": "text",
                                "text": "\n\nIt includes critique of what we saw as the common approach to 'liveness' in future of coding community. We explain ways in which live debugging is the opposite of live coding."
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T5TCAFTA9",
        "attachments": [
            {
                "from_url": "https://zenodo.org/record/7843567",
                "id": 1,
                "original_url": "https://zenodo.org/record/7843567",
                "fallback": "Zenodo: The Meaning of Live: From Art Without Audience to Programs Without Users",
                "text": "The concept of an `art without audience' has informed live coding since its beginnings. Live Coding concentrates on collective work and questions the division between producers and consumers. This understanding of art has enabled a parallel strategy in the understanding of programming: just as an audience is not necessary for art, a user isn't necessary for programming. In the same sense as we question the separation between developer and user, we question the juxtaposition of artist and audience. This gives us occasion to recall some aspects of live coding which we have always found central to this practice: the displacement of the relation between programmers and programs, and the emancipatory potential of public thought.",
                "title": "The Meaning of Live: From Art Without Audience to Programs Without Users",
                "title_link": "https://zenodo.org/record/7843567",
                "service_name": "Zenodo"
            }
        ],
        "reactions": [
            {
                "name": "eyes",
                "users": [
                    "U04717WKH5K"
                ],
                "count": 1
            }
        ]
    }
]