[
    {
        "client_msg_id": "af08e331-33a7-4ae2-9c28-7638a9adeb8c",
        "type": "message",
        "text": "Hey Michael! I previously enjoyed reading some of your blogs like \"Against software development\". Given some of the themes you mentioned (interaction of small computing elements), you might be interested in this old paper: <http:\/\/maya.com\/content\/publications\/0034-the-trillion-node-network\/maya_trillion_node_network.pdf>\n\nTowards the end it proposes attribute\/values as the next step above bytes as the basis of interoperability, and one might argue that in the intervening years that has been at least somewhat imperfectly realized by the widespread adoption of JSON APIs",
        "user": "UDJ2TKB99",
        "ts": "1543570150.000200",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "7acd71947ea2",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-10-04\/2564854327154_7acd71947ea203e9a69b_72.jpg",
            "first_name": "Joe",
            "real_name": "Joe Trellick",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "joe",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1543512843.133200",
        "parent_user_id": "UEF95M2RH"
    },
    {
        "client_msg_id": "98e61379-3e0b-4f8a-b8d5-c0a6ddad0a50",
        "type": "message",
        "text": "Hi - I am Antranig Basman. I'm part of an overlapping group of publicly funded projects to improve people's access to technology. These are funded under the general headline of \"accessibility\" and improving the lives of people with disabilities, but we quickly realised that this mission will be uneconomic and unpractical unless we reform the way technology is built, and most importantly eliminate the use of all currently popular programming languages.\n\nWhat we seek is to \"democratise the affordances of computation\" so that they can be accessed with as few barriers as possible imposed by interaction modality, style of cognition, representation, etc. We say \"the affordances of computation\" rather than \"computation\" since we believe what the public needs is not well described by computation as classically conceived.\n\nIf you're interested in a semi-technical exposition of what this means in terms of a conception of \"Open Authorship\", you can read my Onward 2018 preprint at <https:\/\/github.com\/amb26\/papers\/blob\/master\/onward-2016\/onward-2016.pdf> - I live in London, looking forward to chatting with you all about many topics of interest! I'm particularly interested these days in reading about the philosophy and history of the numerous scientific and mathematical concepts that we tend to take for granted, and am a great fan of Lakatos, Lakoff, and Lakos.",
        "user": "UEH6T3RJB",
        "ts": "1543580109.007600",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g5184556fcf3",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/75184556fcf3aa660f5e56b8e5bdd46d.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0021-72.png",
            "first_name": "",
            "real_name": "Antranig Basman",
            "display_name": "Bosmon",
            "team": "T5TCAFTA9",
            "name": "amb26slack",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "reactions": [
            {
                "name": "wave",
                "users": [
                    "U5TCAFTD3",
                    "UDJ2TKB99",
                    "U85HCL7JP",
                    "U8A5MS6R1",
                    "U6KQ2S410",
                    "U5STGTB3J",
                    "UD72R4WTU",
                    "UE0ETTCG7",
                    "UC2A2ARPT",
                    "UERTM1JPR"
                ],
                "count": 10
            }
        ]
    }
]