[
    {
        "client_msg_id": "89977c0c-d8de-4e32-92d7-031bdc556ecb",
        "type": "message",
        "text": "<@U5TCAFTD3> and Vlad Magdalin (not here at least under that name), what breadth and depth in the Podcast <https:\/\/futureofcoding.org\/episodes\/035> this week!  What is planning?  (A: \"Rules for a computer to follow.\")  What is direct manipulation in contrast to liveness?  Got me thinking.\n\nI propose a new term \"direct attention\" to help draw attention to the nuance of manipulation.  Consider this: much of what we call direct manipulation is not as direct as it seems.  In some sense, drawing on a screen with a mouse or trackpad is not nearly as direct as sculpting clay.  The tool, the control surface, is removed from the material being manipulated.  And it's not that fingers are always more direct else why would anyone want a stylus for a tablet?  In that case, fingers are getting in the way of something.  Of what?  Our attention.  With a stylus, most can more easily attend to the work.  Most, but not all.  For the disabled or a young child, the pencil will be less direct rather than more.  And it works the other way too.\n\nExperience, training, habit changes the fluidity of things.  Some are comfortable with email as a locus (or Skype) over AirDrop.  Language, natural language, is humanity's most significant attention modifier: spoken language more naturally, written language through learning and practice with its attendant flexibility and abstraction.  A master, through the technology in his or her mind, may be more at home, more readily able to manipulate the abstraction than medium, perhaps to the point of becoming disconnected from the substrate.  (An anecdote involving Beethoven comes to mind.)  And at that point, I suppose the interface has become a new material and ultimately a thoroughly subjective one.",
        "user": "UA14TGLTC",
        "ts": "1546944044.300900",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gae6d55db9d1",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/3ae6d55db9d15b79bc683a8031fc2588.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0009-72.png",
            "first_name": "",
            "real_name": "William Taysom",
            "display_name": "wtaysom",
            "team": "T5TCAFTA9",
            "name": "wtaysom",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1546944044.300900",
        "reply_count": 4,
        "reply_users_count": 3,
        "latest_reply": "1547910842.372500",
        "reply_users": [
            "UDLFL2HD4",
            "UA14TGLTC",
            "U5STGTB3J"
        ],
        "replies": [
            {
                "user": "UDLFL2HD4",
                "ts": "1547024328.305900"
            },
            {
                "user": "UA14TGLTC",
                "ts": "1547026449.306100"
            },
            {
                "user": "UDLFL2HD4",
                "ts": "1547080833.311000"
            },
            {
                "user": "U5STGTB3J",
                "ts": "1547910842.372500"
            }
        ],
        "subscribed": false,
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U5TCAFTD3"
                ],
                "count": 1
            }
        ]
    }
]