[
    {
        "client_msg_id": "a2ea3184-f4c6-4e2f-abd7-4e1e83cb8607",
        "type": "message",
        "text": "Are there any serious LaTeX competitors in terms of comparable vocabulary/document layout power, but better programming experience? Trying to understand e.g. variadic macros and my head is spinning.",
        "user": "UFB8STN7K",
        "ts": "1571522910.064800",
        "team": "T5TCAFTA9",
        "thread_ts": "1571522910.064800",
        "reply_count": 3,
        "reply_users_count": 3,
        "latest_reply": "1571637178.105700",
        "reply_users": [
            "UC2A2ARPT",
            "UJN1TAYEQ",
            "UJBAJNFLK"
        ],
        "subscribed": false,
        "reactions": [
            {
                "name": "eyes",
                "users": [
                    "UNTRC48LC",
                    "UA14TGLTC"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "9821860f-054a-4fe0-b58a-5a787e46e400",
        "type": "message",
        "text": "<@ULM3U6275> I am not a fan of web development tools. i am none too happy about big brother spying on my every keystroke, and the lack of privacy and security for valuable IP i could never tolerate in a business. The fact that the browsers are controlled by a few entrenched competitors, and due to the baroque hypercomplex and messy design of the web which just keeps tacking on more function like the Winchester Mystery House is not ideal. That these big organizations are immune to suggestions and changes, and bugs don't get fixed promptly, makes we yearn for a simpler less messy underpinnings. The web browsers refuse to let us use UDP packets, except when they deem it okay, and UDP is the way to go for high performance; so much less overhead than TCP.  Google &amp; its co-conspirators have been steering the web browser towards being an operating system bigger than windows. It was a clever strategy and clearly has convinced young people that it is the only way forward. I would prefer a real operating system, that is lean and mean, and not such a mess. CSS is one of the worst layout methodologies ever invented. Like the original US television system which was called NTSC (later nicknamed never twice the same color), i wish i could find an ancronym for CSS that involves mysterious movement of your blocks in baffling ways.",
        "user": "UEQ6M68H0",
        "ts": "1571523718.064900",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U79HM6726",
                    "UMVFWPZ36"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "5b1b58be-c34d-41b6-89e9-433cc69ebe4e",
        "type": "message",
        "text": "(This is a favorite problem of mine, btw - the model and code duplication all over the place - not just in one language but in a system across many programs and languages - today we need to repeat way too much without adding value)\n\nI see two or three overlapping ideas here. The shared observation is that 'cross reference represented as strings' is the usual way. This has problems with renaming because we have to find all instances of the same string but only where it references the same entity. Using an `id` for the cross reference and the string name as metadata attached to the id kind of solves this (with tooling support, see unison).\n\nBut the original post is talking about something else too. Specifically if I have a name `setA` and decide to rename A to B, I want the name to automatically become `setB`. Even with id references, this would have to be manual because `setA` is the metadata attached to id1 and `getA` is the metadata attached to `id2` etc. Unless we go a bit further and instead of attaching string metadata to the id, define multiple pieces of metadata to link to the entities `set` and `A`.\n\nThe main requirement is you want only one place where the string `A` exists and it is referenced everywhere else by its id.",
        "user": "U8A5MS6R1",
        "ts": "1571528670.065100",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "U8A5MS6R1",
            "ts": "1571528698.000000"
        },
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UJ6LDMMN0",
                    "UL3CJ7YKC"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "ffc5597a-85c2-49dc-bc4b-13982b202e2e",
        "type": "message",
        "text": "Perhaps HTML + MathML could have grown into a contender if the latter hadn't been defenestrated.",
        "user": "UC2A2ARPT",
        "ts": "1571530369.066000",
        "team": "T5TCAFTA9",
        "thread_ts": "1571522910.064800",
        "parent_user_id": "UFB8STN7K",
        "reactions": [
            {
                "name": "cry",
                "users": [
                    "UFB8STN7K"
                ],
                "count": 1
            },
            {
                "name": "+1::skin-tone-6",
                "users": [
                    "UCKRZS3DZ"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "f85f2d10-a0a0-43f4-8e5b-1d1a848b4ce7",
        "type": "message",
        "text": "<@UEQ6M68H0> “i am none too happy about big brother spying on my every keystroke” I’m concerned about that as well, but there’s no requirement that a web browser be used with a server.  I’m using single page Javascript apps straight from a local file the desktop. Also, being able to choose to drop the same file onto a server where everyone could run it at the click of a link is extremely valuable (consider how many fewer potential users would be willing to download and install an app vs clicking on a link). As for UDP/TCP, all the browsers will be supporting full UDP &amp; TCP sockets and mDNS soon. Take a look at the Chrome or Firefox dev builds. There’s also no need to use either HTML (besides a few lines to boot your JS code with) or CSS (aside from setting style attributes on elements via JS). I’d agree that the DOM is not the layout engine I’d design, but it’s very fast and full featured, and runs everywhere. While it makes may things that used to be easy, more difficult (view management), it also makes many things that used to be very hard, very easy (text layout). The value of the browser’s sandbox is also worth considering. For security reasons, I don’t run any apps that aren’t from highly trusted sources on my trusted laptop anymore, and certainly no code downloaded from github. Maybe that will change once the desktop apps and terminal are fully sandboxed but it’s looking like that will probably come in the form of app signing from big vendors like MS, Google and Apple and I don’t want any of them controlling what apps I can run. The browser is the only escape (for typical users) from the app signing Dystopia.",
        "user": "ULM3U6275",
        "ts": "1571531520.066200",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "ULM3U6275",
            "ts": "1571531950.000000"
        },
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UJ6LDMMN0",
                    "UMVFWPZ36"
                ],
                "count": 2
            },
            {
                "name": "heart",
                "users": [
                    "UMVFWPZ36"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "93ffef0f-e387-4f4a-adf5-c9d603e6c9f0",
        "type": "message",
        "text": "Interesting! Yeah, that's totally a common place thing in programming: Foo, FooFactory, FooContainer, etc.\n\nI'll have to keep that in mind for my \"Interact\" project: rather than storing entities directly (e.g. any party of code or data), it stores the steps or actions that were taken to create it (and thus there's no distinction between user interaction, and \"code\"). So for example, even if you manually create something called \"Foo\" and something called \"FooBar\", you could edit the actions to be as if you associated the string \"Foo\" to a variable, and then used that variable to build the names of the other things. Then if you change what that value \"was\", the other things change too",
        "user": "UAVCC2X70",
        "ts": "1571544212.067700",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UAVCC2X70",
            "ts": "1571544323.000000"
        },
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UL3CJ7YKC",
                    "UHWC9PXBL",
                    "UNCP67JSK"
                ],
                "count": 3
            }
        ]
    },
    {
        "client_msg_id": "1f6600a5-c344-49db-85fe-d53918c8e58f",
        "type": "message",
        "text": "<@ULM3U6275> Nothing fast about the DOM. Jobs at Apple wanted Display Postscript, but that doesn't animate well, and the DOM is a poor version of a retained graphics model. I think they could have picked a well thought out graphics foundation at the beginning, but chose instead to constantly add more and more function to HTML/CSS making it the mess that it is. SVG shows the same creeping complexity, and who knows how many decades before the browsers implement all of the features. The fact that the feature set is invented and then a decade rolls by while the features are gradually rolled out, and with the freezes in the mobile world where devices are cut off from update streams, it makes for a bizarre situation where 89% of the user base has some key feature.  What is a programmer to do then? It is chaos the way they did it. In the good old Win32 and Quickdraw days of Windows and Apple, you had a fixed specification, and a very solid underpinning. Software developers loathe this flabby \"almost-implemented\" state of the web, and it makes for intensely flaky software.",
        "user": "UEQ6M68H0",
        "ts": "1571548660.068300",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UEQ6M68H0",
            "ts": "1571630111.000000"
        },
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U79HM6726",
                    "UA14TGLTC"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "fb65b2f4-8e86-4b9c-964c-183a3604504d",
        "type": "message",
        "text": "<@UJBAJNFLK> Can you elaborate on \"the technology and the culture behind it are ver much fashion-drive\"? Especially, I am not sure I understand properlly \"fashion-drive\" and what it implies in your view. But If I guess well, I suppose I second the point of <@ULM3U6275>: \"abstractions can separate one from this\". When I talked about web standards, I talked about the technologies, not the people around it.",
        "user": "UJ6LDMMN0",
        "ts": "1571553162.069000",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "76e97f6c-cb6c-476e-b4c4-68c72b539a25",
        "type": "message",
        "text": "&gt;  user interfaces are constrained by the page-in-browser-tab model\nYou can use web standards outside the browser if you want to be free from this constraint.",
        "user": "UJ6LDMMN0",
        "ts": "1571553301.069200",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "b450438a-a868-49a7-9f16-443b70d3c6f5",
        "type": "message",
        "text": "<@UEQ6M68H0> \" I would prefer a real operating system, that is lean and mean, and not such a mess\". I would too, but as long as it is widely used by people. I want to build tools that people can use as soon as possible. If I build on web standards, people can use them now. With a clean real OS (I guess you mean low level OS like linux?), I first have to create it with all features I need, convince people to use it, then build my tools on it. But maybe you had something in mind that already exists I can use now?",
        "user": "UJ6LDMMN0",
        "ts": "1571554477.069600",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UMVFWPZ36",
                    "UA14TGLTC"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "aff8ba32-21e3-4a49-8a80-74e69474e22f",
        "type": "message",
        "text": "And as for UDP discussion, if it is something you miss now, web standards don't forbid it to use it, they forbid to use it from the browser. You can use UDP with web standards outside the browser. My point of view, and the way I view how I build thing now is: using web standards as much as I can, and use something else if I can't do a specific thing with web standards.",
        "user": "UJ6LDMMN0",
        "ts": "1571554735.069800",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "9483cb4c-06d5-4fe0-a130-264604709b2f",
        "type": "message",
        "text": "And to be clear: I don't promote web standards based on the way they were designed and their pro and cons as technologies, but as a plateform that is everywhere and that won't be thrown away soon. I am confident that what I will build on it will be available to a maximum of people and for a long time. A don't see any other plateform with this property. And, for me, this property is very desirable for building tools for FoC that can be used. Sidenote: I am on the \"denerding side\" of Foc, I want to build a future of programming that first targets end-user programming, so you understand why I am seduced by the ubiquity of the web plateform.",
        "user": "UJ6LDMMN0",
        "ts": "1571555308.070000",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "58BF4A16-6A66-4D59-AB8B-5332D228E547",
        "type": "message",
        "text": "<@UJ6LDMMN0> <@ULM3U6275> You can always add a layer of abstraction, but that’s one more layer to maintain. Ideally, for a project running for ten years, you want dependencies to be stable over ten years. Can you imagine working with 2009’s Web tech today?",
        "user": "UJBAJNFLK",
        "ts": "1571555929.073200",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3"
    },
    {
        "client_msg_id": "EBE465CD-B197-48E5-AEDE-A4683F06471A",
        "type": "message",
        "text": "As for UI, you can indeed reimplement the wheel inside a page, but you are still limited by the browser whose GUI is designed for... browsing. Try to do elaborate key event handling. for example. Try simply redefining Ctrl-T. ",
        "user": "UJBAJNFLK",
        "ts": "1571556130.076600",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U79HM6726",
                    "UA14TGLTC",
                    "UHWC9PXBL"
                ],
                "count": 3
            }
        ]
    },
    {
        "client_msg_id": "88eb7651-c42f-400e-bdeb-7357739225cb",
        "type": "message",
        "text": "(developers: <@UJBAJNFLK> was just giving an example, _please_ don't actually redefine any of my keystrokes or mouse actions, thanks)",
        "user": "UE6EFEPTQ",
        "ts": "1571561917.076900",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "laughing",
                "users": [
                    "UJ6LDMMN0"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "a3ad1e03-b456-47c3-a87f-238136630c1a",
        "type": "message",
        "text": "<@UL3CJ7YKC> What you describing looks a lot like multidispatch methods in Common Lisp.\n\nYou would have method 'set', that is dispatched over both 'a' and 'A'.",
        "user": "UCKRZS3DZ",
        "ts": "1571573728.077100",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UCKRZS3DZ",
            "ts": "1571574296.000000"
        },
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "8A887660-2B89-4C84-886F-464148F20803",
        "type": "message",
        "text": "<@UCKRZS3DZ> Ah great! Thanks that is a great insight! Years before at collage I did not understand that feature, we did not learn lisp. Now I am! Do you have any other related insights?:) ",
        "user": "UL3CJ7YKC",
        "ts": "1571574014.079800",
        "team": "T5TCAFTA9",
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "61ddbb77-5d31-4107-b987-81b3eb63ce21",
        "type": "message",
        "text": "<@UL3CJ7YKC> You're welcome) I am not sure what insights are related. Actually I don't understand exactly why you want this feature in the first place. I got from your post, that it makes renaming of the terms easier. Any other reasons?",
        "user": "UCKRZS3DZ",
        "ts": "1571574276.080000",
        "team": "T5TCAFTA9",
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "75A05465-D971-4587-8694-5F357D7B1750",
        "type": "message",
        "text": "It's a huge one. I am fed up with search and replaces :) it prevents me to refactor other things easily which involves renaming.",
        "user": "UL3CJ7YKC",
        "ts": "1571575977.081000",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UL3CJ7YKC",
            "ts": "1571576043.000000"
        },
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "f9524d59-4013-45bf-9bd1-9bba0459bf8f",
        "type": "message",
        "text": "I see",
        "user": "UCKRZS3DZ",
        "ts": "1571577028.081400",
        "team": "T5TCAFTA9",
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "42C8A46C-21AA-424B-AE1B-8234565E6800",
        "type": "message",
        "text": "<@UJBAJNFLK> If your concern is a project running for a long time, I can still run the first web page I made in the 1990s and it works the same and everyone can still use it, even on platforms that didn’t exist at the time like smartphones. Can you still run 32bit desktop apps compiled for whatever version of the OS you were using in the 1990s? Many of the OSes I used at the time (Irix, HP/UX, SunOS, NeXTstep) have been discontinued. If you want to reinvent a sandboxed, cross platform environment that’s open, crazy fast, has advanced text rendering, and runs everywhere, that’s cool - it’s something I’d like to see done and I’d definitely take a look at it if/when it’s ready, but until then I’ll use the one that already exists.",
        "user": "ULM3U6275",
        "ts": "1571578109.088500",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "ULM3U6275",
            "ts": "1571595693.000000"
        },
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "ok_hand",
                "users": [
                    "UJ6LDMMN0"
                ],
                "count": 1
            },
            {
                "name": "+1",
                "users": [
                    "UMVFWPZ36",
                    "UA14TGLTC",
                    "UHWC9PXBL"
                ],
                "count": 3
            }
        ]
    },
    {
        "client_msg_id": "f114d68f-1749-4f17-99b6-8433915bc2a0",
        "type": "message",
        "text": "I'll just throw this link here: <http://canonical.org/~kragen/eotf>",
        "user": "UCUSW7WVD",
        "ts": "1571582795.089100",
        "team": "T5TCAFTA9",
        "thread_ts": "1570632039.005300",
        "parent_user_id": "U5TCAFTD3",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UMVFWPZ36",
                    "UHWC9PXBL"
                ],
                "count": 2
            }
        ]
    },
    {
        "client_msg_id": "5a53650d-689a-4679-a25f-d63af294e78b",
        "type": "message",
        "text": "<@UL3CJ7YKC> do you use strongly typed languages with good refactoring tools? TypeScript and C# in VS (and Sublime Text) have great project wide intelligent \"Rename\".",
        "user": "UMVFWPZ36",
        "ts": "1571597965.090300",
        "team": "T5TCAFTA9",
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "9D4278B9-C98A-4563-A82D-7EB22E6F0040",
        "type": "message",
        "text": "Yes sure, I use Webstorm which has the best such feature I think.",
        "user": "UL3CJ7YKC",
        "ts": "1571601162.093000",
        "team": "T5TCAFTA9",
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "701E3A42-D4D6-4378-AAE3-B8768295C4C6",
        "type": "message",
        "text": "<@UAVCC2X70> yes exactly as you described. And its not done yet.... :exploding_head:\n\nEspecially awful when I want to change a database table name *because the software itself and the meanings evolve(!)*, but I don't have the courage, because god knows what breaks. \n\nBut for that we have migration at least. But for Foo - FooFactory - SetFoo we have nothing :D",
        "user": "UL3CJ7YKC",
        "ts": "1571601398.096500",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UL3CJ7YKC",
            "ts": "1571601447.000000"
        },
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC"
    },
    {
        "client_msg_id": "F1518BFD-8E04-4E15-BCB0-1D0B444CDE38",
        "type": "message",
        "text": "Unison language can do this AFAIK. This is more of a traditional AST-rewriting approach (not “function names = data”), but Mesh Spreadsheet also lets you just type over an existing name and have it update all places it’s referenced. See near the end of the video here: <https://m.youtube.com/watch?v=_U6gE3cNgbI>",
        "user": "UBRKVHMCL",
        "ts": "1571605421.098500",
        "team": "T5TCAFTA9",
        "edited": {
            "user": "UBRKVHMCL",
            "ts": "1571606151.000000"
        },
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https://www.youtube.com/",
                "title": "Mesh Spreadsheet - alpha demo 2019-10-11 (part 1: basics, tables, functions, naming cells)",
                "title_link": "https://m.youtube.com/watch?v=_U6gE3cNgbI",
                "author_name": "Chris Pearson",
                "author_link": "https://www.youtube.com/user/chrispysd",
                "thumb_url": "https://i.ytimg.com/vi/_U6gE3cNgbI/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: Mesh Spreadsheet - alpha demo 2019-10-11 (part 1: basics, tables, functions, naming cells)",
                "video_html": "<iframe width=\"400\" height=\"300\" src=\"https://www.youtube.com/embed/_U6gE3cNgbI?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
                "video_html_width": 400,
                "video_html_height": 300,
                "from_url": "https://m.youtube.com/watch?v=_U6gE3cNgbI",
                "service_icon": "https://a.slack-edge.com/80588/img/unfurl_icons/youtube.png",
                "id": 1,
                "original_url": "https://m.youtube.com/watch?v=_U6gE3cNgbI"
            }
        ],
        "thread_ts": "1571489526.050200",
        "parent_user_id": "UL3CJ7YKC",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UL3CJ7YKC",
                    "UNCP67JSK"
                ],
                "count": 2
            }
        ]
    }
]